// ============================================================
// دليل الرقاة - بيانات الأذكار
// ============================================================



export interface Zekr {
  title? : string;
  text: string;
  count: number;
  fadl?: string;
  source?: string;
}


export interface ZekrCategory {
  id: string;
  name: string;
  icon: string;
  azkar: Zekr[];
}

export const azkarCategories: ZekrCategory[] = [
  {
  id: 'morning-azkar',
  name: 'أذكار الصباح',
  icon: 'Sunrise',
  azkar: [
    {
      title: 'آية الكرسي',
      text: `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ

اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].`,
      count: 1,
      fadl: 'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.'
    },
    {
      title: 'سورة الإخلاص',
      text: `بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم

قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.`,
      count: 3,
      fadl: 'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).'
    },
    {
      title: 'سورة الفلق',
      text: `بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم

قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.`,
      count: 3,
      fadl: ''
    },
    {
      title: 'سورة الناس',
      text: `بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم

قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.`,
      count: 3,
      fadl: ''
    },
    {
  
      text: `أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.`,
      count: 1,
      fadl: ''
    },
    {
      title: 'سيد الاستغفار',
      text: `اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .`,
      count: 1,
      fadl: 'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.'
    },
    {
      text: `رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.`,
      count: 3,
      fadl: 'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.'
    },
    {
   
      text: `اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.`,
      count: 4,
      fadl: 'من قالها أعتقه الله من النار.'
    },
    {
  
      text: `اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.`,
      count: 1,
      fadl: 'من قالها حين يصبح أدى شكر يومه.'
    },
    {

      text: `حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.`,
      count: 7,
      fadl: 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.'
    },
    {
  
      text: `بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.`,
      count: 3,
      fadl: 'لم يضره من الله شيء.'
    },
    {
 
      text: `اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.`,
      count: 1,
      fadl: ''
    },
    {
  
      text: `أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.`,
      count: 1,
      fadl: ''
    },
    {

      text: `سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.`,
      count: 3,
      fadl: ''
    },
    {
 
      text: `اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.`,
      count: 3,
      fadl: ''
    },
    {
   
      text: `اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.`,
      count: 3,
      fadl: ''
    },
    {
  
      text: `اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.`,
      count: 1,
      fadl: ''
    },
    {
 
      text: `يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.`,
      count: 3,
      fadl: ''
    },
    {
  
      text: `أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.`,
      count: 1,
      fadl: ''
    },
    {
 
      text: `اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.`,
      count: 1,
      fadl: ''
    },
    {
 
      text: `أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.`,
      count: 3,
      fadl: ''
    },
    {
 
      text: `اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.`,
      count: 10,
      fadl: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.'
    },
    {
 
      text: `اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.`,
      count: 3,
      fadl: ''
    },
    {
      
      text: `اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.`,
      count: 3,
      fadl: ''
    },
    {
 
      text: `أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.`,
      count: 3,
      fadl: ''
    },
    {
     
      text: `يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.`,
      count: 3,
      fadl: ''
    },
    {
    
      text: `اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.`,
      count: 1,
      fadl: ''
    },
    {
     
      text: `اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.`,
      count: 1,
      fadl: 'ذكر طيب.'
    },
    {
   
      text: `لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.`,
      count: 100,
      fadl: 'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.'
    },
    {
     
      text: `سُبْحـانَ اللهِ وَبِحَمْـدِهِ.`,
      count: 100,
      fadl: 'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.'
    },
    {
    
      text: `أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ`,
      count: 100,
      fadl: 'مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.'
    }
   ],
  },
  {
  id: 'evening-azkar',
  name: 'أذكار المساء',
  icon: 'Moon',
  azkar: [
    {
      title: 'آية الكرسي',
      text: `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ

اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].`,
      count: 1,
      fadl: 'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.'
    },
    {
      title: 'آخر آيتين من سورة البقرة',
      text: `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ

آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286].`,
      count: 1,
      fadl: 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.'
    },
    {
      title: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      text: `قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.`,
      count: 3,
      fadl: 'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).'
    },
    {
      title: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      text: `قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.`,
      count: 3,
      fadl: ''
    },
    {
      title: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      text: `قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.`,
      count: 3,
      fadl: ''
    },
    {
     
      text: `أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.`,
      count: 1,
      fadl: ''
    },
    {
      title: 'سيد الاستغفار',
      text: `اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .`,
      count: 1,
      fadl: 'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.'
    },
    {
      
      text: `رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.`,
      count: 3,
      fadl: 'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.'
    },
    {
     
      text: `اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.`,
      count: 4,
      fadl: 'من قالها أعتقه الله من النار.'
    },
    {
     
      text: `اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.`,
      count: 1,
      fadl: 'من قالها حين يمسى أدى شكر يومه.'
    },
    {
     
      text: `حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.`,
      count: 7,
      fadl: 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.'
    },
    {
    
      text: `بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.`,
      count: 3,
      fadl: 'لم يضره من الله شيء.'
    },
    {
  
      text: `اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.`,
      count: 1,
      fadl: ''
    },
    {
    
      text: `أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.`,
      count: 1,
      fadl: ''
    },
    {
     
      text: `سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.`,
      count: 3,
      fadl: ''
    },
    {
     
      text: `اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.`,
      count: 3,
      fadl: ''
    },
    {
      
      text: `اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.`,
      count: 3,
      fadl: ''
    },
    {
  
      text: `اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.`,
      count: 1,
      fadl: ''
    },
    {
     
      text: `يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.`,
      count: 3,
      fadl: ''
    },
    {
      
      text: `أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.`,
      count: 1,
      fadl: ''
    },
    {
     
      text: `اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.`,
      count: 1,
      fadl: ''
    },
    {
   
      text: `أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.`,
      count: 3,
      fadl: ''
    },
    {
     
      text: `اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.`,
      count: 10,
      fadl: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.'
    },
    {
    
      text: `اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.`,
      count: 3,
      fadl: ''
    },
    {
      text: `اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.`,
      count: 3,
      fadl: ''
    },
    {
  
      text: `أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.`,
      count: 3,
      fadl: ''
    },
    {
      text: `يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.`,
      count: 3,
      fadl: ''
    },
    {
    
      text: `لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.`,
      count: 100,
      fadl: 'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.'
    },
    {
     
      text: `اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.`,
      count: 1,
      fadl: 'ذكر طيب.'
    },
    {
    
      text: `سُبْحـانَ اللهِ وَبِحَمْـدِهِ.`,
      count: 100,
      fadl: 'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.'
  },
  ]
  },
 {
  id: 'sleep-azkar',
  name: 'أذكار النوم ',
  icon: 'Moon',
  azkar: [
    {
   
      text: `بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي، وَبِكَ أَرْفَعُـه، فَإِنْ أَمْسَـكْتَ نَفْسـي فَارْحَـمْها، وَإِنْ أَرْسَلْتَـها فَاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.`,
      count: 1,
      fadl: ''
    },
    {
    
      text: `اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا، لَكَ مَمَـاتـها وَمَحْـياها، إِنْ أَحْيَيْـتَها فَاحْفَظْـها، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها. اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة.`,
      count: 1,
      fadl: ''
    },
    {
   
      text: `اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك.`,
      count: 3,
      fadl: ''
    },
    {
  
      text: `بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا.`,
      count: 1,
      fadl: ''
    },
    {
  
      text: `الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي.`,
      count: 1,
      fadl: ''
    },
    {
    
      text: `اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.`,
      count: 1,
      fadl: ''
    },
    {
   
      text: `اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـأْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِيِّـكَ الّـذي أَرْسَلْـت.`,
      count: 1,
      fadl: ''
    },
    {
      text: `سُبْحَانَ اللَّهِ.`,
      count: 33,
      fadl: ''
    },
    {
    
      text: `الْحَمْدُ لِلَّهِ.`,
      count: 33,
      fadl: ''
    },
    {
     
      text: `اللَّهُ أَكْبَرُ.`,
      count: 34,
      fadl: ''
    },
    {
      title: 'المعوذات والنفث في الكفين',
      text: `يجمع كفيه ثم ينفث فيهما والقراءة فيهما: {قل هو الله أحد} و{قل أعوذ برب الفلق} و{قل أعوذ برب الناس}، ومسح ما استطاع من الجسد، يبدأ بهما على رأسه ووجهه وما أقبل من جسده.`,
      count: 3,
      fadl: ''
    },
    {
      title: 'آخر آيتين من سورة البقرة',
      text: `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ

آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286]`,
      count: 1,
      fadl: 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.'
    },
    {
      title: 'آية الكرسي',
      text: `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ

اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [البقرة 255]`,
      count: 1,
      fadl: 'أجير من الجن حتى يصبح.'
    },
    {
      title: 'أذكار من قلق في فراشه ولم ينم',
      text: `عن بريدة رضي الله عنه، قال: شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم فقال: يا رسول الله! ما أنام الليل من الأرق، فقال النبي صلى الله عليه وسلم: "إذا أويت إلى فراشك فقل: اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارًا من خلقك كلهم جميعًا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت".

عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع كلمات: "أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون".`,
      count: 1,
      fadl: ''
    },
    {
      title: 'أذكار الأحلام',
      text: `عن أبي قتادة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الرؤيا الصالحة" وفي رواية "الرؤيا الحسنة من الله، والحلم من الشيطان، فمن رأى شيئًا يكرهه فلينفث عن شماله ثلاثًا وليتعوذ من الشيطان، فإنها لا تضره".`,
      count: 1,
      fadl: ''
   },
  ]
  },
{
    id: 'istiqaz',
    name: 'أذكار الاستيقاظ',
    icon: 'AlarmClock',
    azkar: [
     {
      text: `الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور.`,
      count: 1
    },
    {
      text: `الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه.`,
      count: 1
    },
    {
      text: `لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي.`,
      count: 1
    }
    ],
  },
{
    id: 'salat',
    name: 'أذكار  الصلاة',
    icon: 'Prayer',
    azkar: [
      {
title: 'أدعية استفتاح الصلاة',
      text: `اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللهم نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأبْيَضُ مِنَ الدَّنَسِ، اللهم اغْسِلْنِيْ مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ والْبَرَدِ.`,
      count: 1
    },
    {
title: 'أدعية استفتاح الصلاة',
      text: `سُبْحَانَكَ اللهم وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ.`,
      count: 1
    },
    {
      text: `الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.`,
      count: 1
    },
    {
      text: `اللهُ أَكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَّاصِيْلًا. أعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ رَبَّ جَبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيْلَ، فَاطِرَ السَّمَوَاتِ وَالْأرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوا فِيْهِ يَخْتَلِفُونَ، اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ.`,
      count: 1
    },
    {
      text: `وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَوَاتِ وَالْأرْضَ حَنِيْفًا وَّمَا أنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلَاتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلهِ رَبِّ الْعَالَمِيْنَ، لَا شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَانَا مِنَ الْمُسْلِمِيْنَ، اللهم أنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أنْتَ، أنْتَ رَبِّيْ وَأنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لَا يَغْفِرُ الذُّنوبَ إِلَّا أنْتَ. وَاهْدِنِيْ لِأحْسَنِ الْأخْلَاقِ لَا يَهْدِيْ لِأحْسَنِهَا إِلَّا أنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أسْتَغْفِرُكَ وَأتُوْبُ إِلَيْكَ.`,
      count: 1
    },
    {
      title: 'أدعية الركوع',
      text: `سُبْحانَ رَبِّيَ الْعَظِيْمِ.`,
      count: 3
    },
    {
      text: `سُبْحَانَ رَبِّيَ العَظِيمِ وَبِحَمْدِهِ.`,
      count: 3
    },
    {
      text: `سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي.`,
      count: 1
    },
    {
      text: `سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلَائِكَةِ وَالرُّوْحِ.`,
      count: 1
    },
    {
      text: `سُبْحَانَ ذِيْ الْجَبَرُوْتِ، وَالْمَلَكُوْتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي وَبَصَرِي، وَمُخِّي وَعَظْمِي وَعَصَبِي.`,
      count: 1
    },
    {
title: 'أدعية الرفع من الركوع',
      text: `سَمِعَ اللهُ لِمَنْ حَمِدَهُ.`,
      count: 1
    },
    {
      text: `رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبارَكًا فِيْهِ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ اسْلَمْتُ، خَشَعَ لَكَ سَمْعِيْ، و بَصَـرِيْ، وَمُخِّيْ، وَعَظْمِيْ، وَعَصَبِيْ، وَمَا استَقَلَّتْ بِهِ قَدَمِيْ لِلهِ رَبِّ الْعَالَمِيْنَ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْارْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، أهْلَ الثَّنَاءِ وَالْمَجْدِ، أحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ، اللهم لَا مَانِعَ لِمَا أعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الْجَدُّ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ، وَمِلْءَ الْارْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ، وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْابْيَضُ مِنَ الْوَسَخِ.`,
      count: 1
    },
    {
title: 'أدعية السجود',
      text: `سُبْحَانَ رَبِّيَ الأَعْلَى.`,
      count: 3
    },
    {
      text: `سُبْحَانَ رَبِّيَ الأعْلَى وَبِحَمْدِهِ.`,
      count: 3
    },
    {
      text: `سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ.`,
      count: 1
    },
    {
      text: `سُبْحَانَ ذِي الْجَبْرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ لَكَ سَجَدْتُّ وَبِكَ آمَنْتُ، وَلَكَ أسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِيْ خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ أحْسَنُ الْخَالِقيْنَ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ إِنِّيْ أعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لَا أُحْصِـي ثَنَاءً عَلَيْكَ، أنْتَ كَمَا أثْنَيْتَ عَلَى نَفْسِكَ.`,
      count: 1
    },
    {
      text: `رَبِّ اعْطِ نَفْسِي تَقْوَاهَا زَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا أنْتَ وَلِيُّهَا وَمَوْلَاهَا.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَاجْعَلْ فِيْ سَمْعِيْ نُورًا وَاجْعَلْ فِيْ بَصَرِيْ نُورًا وَاجْعَلْ مِنْ تَحْتِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ يَسَارِي نُورًا وَاجْعَلْ أمَامِي نُورًا وَاجْعَلْ خَلْفِي نُورًا وَأعْظِمْ لِيْ نُورًا.`,
      count: 1
    },
    {
      title: 'أدعية الجلوس بين السجدتين',
      text: `رَبِّ رَبِّ اغْفِرْ لِيْ، رَبِّ اغْفِرْ لِيْ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَاهْدِنِيْ، وَاجْبُرْنِيْ، وَعَافِنِيْ، وَارْزُقْنِيْ، وَارْفَعْنِيْ.`,
      count: 1,
      fadl: 'أجير من الجن حتى يصبح.'
     },
     {
      title: 'دعاء سجود التلاوة',
      text: `سَجَدَ وَجْهِيَ للَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللَّهُ أَحْسَنُ الْـخَالِقِينَ.
اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أجْراً، وَضَعْ عَنِّي بِهَا وِزْرَاً، واْجعَلْهَا لِي عِنْدِكَ ذُخْراً، وتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ.`,


      count: 1
   },

  ],
 },

  





{
    id: 'asalat',
    name: 'أذكار بعد الصلاة',
    icon: 'Hand',
    azkar: [
      {
      text: `أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.`,
      count: 3
    },
    {
      text: `اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام .`,
      count: 1
    },
    {
      text: `لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.`,
      count: 1
    },
    {
      text: `لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.`,
      count: 1
    },
    {
      text: `سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر.`,
      count: 33
    },
    {
      text: `لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.`,
      count: 1
    },
    {
      text: `بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم :
قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَد -ۢ.
بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم :
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَد-.
بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم :
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.`,
      count: 3,
      fadl: 'ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.'
    },
    {
      text: `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيم :
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]`,
      count: 1
    },
    {
      text: `لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير.`,
      count: 10,
      fadl: 'عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح.'
    },
    {
      text: `اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّباً ، وَعَمَـلاً مُتَقَـبَّلاً.`,
      count: 1,
      fadl: 'بَعْد السّلامِ من صَلاةِ الفَجْر.'
    },
    {
      text: `اللَّهُمَّ أَجِرْنِي مِنْ النَّار.`,
      count: 7,
      fadl: 'بعد صلاة الصبح والمغرب.'
    },
    {
      text: `اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.`,
      count: 1
    }
    ],
  },




  

{
    id: 'manzil',
    name: 'أذكار المنزل',
    icon: 'Hand',
    azkar: [
      {
 title: 'أذكار الدخول إلى المنزل',
 text: 'بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا. ', count: 1 },
      
{
 title: 'أذكار الخروج من المنزل',
 text: 'بسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله. اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـل ، أَوْ أَزِلَّ أَوْ أُزَل ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـم ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيّ.. ', count: 1 },
 
          ],
     },
{
    id: 'azan',
    name: 'أذكار الأذان',
    icon: 'Hand',
    azkar: [
{
title: 'ما يقال عند سماع الأذان',
       text: 'يَقُولُ مِثْلَ مَا يَقُولُ الـمُؤَذِّنُ إلاَّ فِي "حَيَّ عَلَى الصَّلاةِ وَحَيَّ عَلَى الفَلاَحِ" فَيَقُولُ: "لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ". ', count: 1 },
      { text: 'عنْ سَعْدِ بْن أَبي وقَّاصٍ رضِيَ اللَّه عنْهُ عَن النبي صَلّى اللهُ عَلَيْهِ وسَلَّم أَنَّهُ قَالَ: "مَنْ قَال حِينَ يسْمعُ المُؤذِّنَ : أَشْهَد أَنْ لا إِله إِلاَّ اللَّه وحْدهُ لا شَريك لهُ ، وَأَنَّ مُحمَّداً عبْدُهُ وَرسُولُهُ ، رضِيتُ بِاللَّهِ ربًّا ، وبمُحَمَّدٍ رَسُولاً ، وبالإِسْلامِ دِينًا ، غُفِر لَهُ ذَنْبُهُ". رواه مسلم .', count: 1 },

{ text: 'عَنْ عبْدِ اللَّهِ بْنِ عَمرِو بْنِ العاصِ رضِيَ اللَّه عنْهُما أَنه سَمِع رسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم يقُولُ : "إِذا سمِعْتُمُ النِّداءَ فَقُولُوا مِثْلَ ما يَقُولُ ، ثُمَّ صَلُّوا علَيَّ ، فَإِنَّهُ مَنْ صَلَّى علَيَّ صَلاةً صَلَّى اللَّه عَلَيْهِ بِهَا عشْراً ، ثُمَّ سلُوا اللَّه لي الْوسِيلَةَ ، فَإِنَّهَا مَنزِلَةٌ في الجنَّةِ لا تَنْبَغِي إِلاَّ لعَبْدٍ منْ عِباد اللَّه وَأَرْجُو أَنْ أَكُونَ أَنَا هُو ، فَمنْ سَأَل ليَ الْوسِيلَة حَلَّتْ لَهُ الشَّفاعَةُ". رواه مسلم .', count: 1 },

{ text: 'عَنْ جابرٍ بن عبد الله رضَي اللَّه عنهما‏ أَنَّ رَسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم قَالَ : "من قَال حِين يسْمعُ النِّداءَ : اللَّهُمَّ رَبَّ هذِهِ الدَّعوةِ التَّامَّةِ ، والصَّلاةِ الْقَائِمةِ، آت مُحَمَّداً الْوسِيلَةَ ، والْفَضَيِلَة، وابْعثْهُ مقَامًا محْمُوداً الَّذي وعَدْتَه ، حلَّتْ لَهُ شَفَاعتي يوْم الْقِيامِة" .رواه البخاري .', count: 1 },
{ text: 'عنْ سَعْدِ بْن أَبي وقَّاصٍ رضِيَ اللَّه عنْهُ عَن النبي صَلّى اللهُ عَلَيْهِ وسَلَّم أَنَّهُ قَالَ: "مَنْ قَال حِينَ يسْمعُ المُؤذِّنَ : أَشْهَد أَنْ لا إِله إِلاَّ اللَّه وحْدهُ لا شَريك لهُ ، وَأَنَّ مُحمَّداً عبْدُهُ وَرسُولُهُ ، رضِيتُ بِاللَّهِ ربًّا ، وبمُحَمَّدٍ رَسُولاً ، وبالإِسْلامِ دِينًا ، غُفِر لَهُ ذَنْبُهُ". رواه مسلم .', count: 1 },
{
title: 'ما يقال بعد سماع الأذان',
       text: 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ. ', count: 1 },
{ text: 'اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، والصَّلاةِ القَائِمَةِ، آتِ مُـحَمَّداً الوَسِيْلَةَ والفَضِيْلَةَ، وابْعَثْهُ مَقَاماً مَـحْمُوداً الَّذِي وَعَدْتَهُ، إنَّكَ لا تُخْلِفُ الـمِيْعَادِ.', count: 1 },

{
title: 'ما يقال بين الأذان والإقامة',

 text: 'ما بين الأذان والإقامة فالدعاء عندئذٍ مرغّب فيه ومستحب.', count: 1 },
{text: 'قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "الدُّعَاءُ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ". ', count: 1 },

{ text: 'قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "إِنَّ الدُّعَاءَ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَادْعُوا".', count: 1 },

    ],
  },

{
    id: 'wudu',
    name: 'أذكار الوضوء',
    icon: 'Hand',
    azkar: [
      { 
title: 'الذكر قبل الوضوء',
text: 'قبل الوضوء: "بِسْمِ ٱللّٰهِ".', count: 1 },
      
      { 
title: 'الذكر بعد الوضوء',
text: 'اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ ', count: 1 },

    ],
  },
{
    id: 'taam',
    name: 'أذكار الطعام',
    icon: 'Hand',
    azkar: [
      { 
title: 'الذكر عند الطعام والشراب',
text: 'بِسْمِ اللهِ.".', count: 1 },
      
      { 
title: 'الذكر عند الفراغ من الطعام والشراب',
text: 'الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّةٍ.', count: 1 },

 { 
title: 'أذكار الضيف',
text: 'أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ ، وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ ، وَصَلَّتْ عَلَيْكُمُ الْمَلائِكَةُ. ', count: 1 },

 { 
title: 'هدى النبى فى الشرب',
text: 'كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ.', count: 1 },
    ],
  },
{
    id: 'masjid',
    name: 'أذكار المسجد',
    icon: 'Hand',
    azkar: [
      { 
title: 'دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ',
text: 'اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا.', count: 1 },
      
      { 
title: 'دُعَاءُ دُخُولِ المَسْجِدِ',
text: 'يَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُول : أَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله، اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك ', count: 1 },

 { 
title: 'دُعَاءُ الخُرُوجِ مِنَ المَسْجِدِ',
text: ' يَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُول : بسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم ', count: 1 },
  

    ],
  },
{
    id: 'safar',
    name: 'أذكار السفر',
    icon: 'Hand',
    azkar: [
      { text: 'سُبْحَانَ الّذِي سَخّرَ لَنَا هَذَا وَمَا كُنّا لَهُ مُقْرِنِينَ وَإِنّا إِلَىَ رَبّنَا لَمُنْقَلِبُونَ', count: 1 },
      { text: 'اللّهُمّ إِنّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرّ وَالتّقْوَىَ. وَمِنَ الْعَمَلِ مَا تَرْضَىَ. ', count: 1 },
      { text: 'اللّهُمّ هَوّنْ عَلَيْنَا سَفَرَنَا هَذَا. وَاطْوِ عَنّا بُعْدَهُ. ', count: 1 },
      { text: 'اللّهُمّ أَنْتَ الصّاحِبُ فِي السّفَرِ. وَالْخَلِيفَةُ فِي الأَهْلِ. اللّهُمّ إِنّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ، فِي الْمَالِ وَالأَهْل وَإِذَا رَجَعَ قَالَهُنّ. وَزَادَ فِيهِنّ: "آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبّنَا حَامِدُونَ', count: 1 },
      
    ],
  },

{
  id: 'hajj',
  name: 'أذكار الحج والعمرة',
  icon: 'Hand',
  azkar: [
    {
      title: 'الذِّكْرُ عِنْدَ الإِحْرَامِ',
      text: 'سُبْحَانَ اللهِ وَالحَمْدُ للهِ وَالله أَكْبَرُ',
      count: 1
    },

    {
      title: 'دُعَاءُ التَّلْبِيَةِ فِي الحَجِّ وَالعُمْرَةِ',
      text: 'لَبَّيْكَ اللَّهُمَّ لَبَّيْك، لَبّيْك لا شَرِيكَ لك لَبَّيْك إنَّ الحَمْدَ، والنِّعْمَةَ، لَكَ والمُلْك، لا شريك لك',
      count: 1
    },

    {
      title: 'الدُّعَاءُ عِنْدَ رُؤْيَةِ الكَعْبَةِ',
      text: 'اللهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، فَحَيِّنَا رَبَّنَا بِالسَّلَامِ',
      count: 1
    },

    {
      title: 'الدُّعَاءُ عِنْدَ اسْتِلَامِ الحَجَرِ الأَسْوَدِ',
      text: 'بِاسْمِ اللهِ وَاللهُ أَكْبَرُ\nلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ، اللَّهُمَّ تَصْدِيقًا بِكِتَابِكَ، وَسُنَّةِ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ',
      count: 1
    },

    {
      title: 'الدُّعَاءُ بَيْنَ الرُّكْنِ اليَمَانِي وَالحَجَرِ الأَسْوَدِ',
      text: 'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ',
      count: 1
    },

    {
      title: 'الدُّعَاءُ فِي الطَّوَافِ',
      text: 'اللهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
      count: 1
    },

    {
      title: 'الدُّعَاءُ بَعْدَ رَكْعَتَيِ الطَّوَافِ',
      text: 'اللَّهُمَّ اعْصِمْنِي بِدِينِكَ، وَطَاعَةِ رَسُولِكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.\nاللَّهُمَّ جَنِّبْنِي حُدُودَكَ.\nاللَّهُمَّ اجْعَلْنِي مِمَّنْ يُحِبُّكَ، وَيُحِبُّ مَلَائِكَتَكَ، وَرُسُلَكَ، وَعِبَادَكَ الصَّالِحِينَ.\nاللَّهُمَّ حَبِّبْنِي إِلَيْكَ، وَإِلَى مَلَائِكَتِكَ، وَرُسُلِكَ، وَعِبَادِكَ الصَّالِحِينَ.\nاللَّهُمَّ آتِنِي مِنْ خَيْرِ مَا تُؤْتِي عِبَادَكَ الصَّالِحِينَ فِي الدُّنْيَا وَالْآخِرَةِ.\nاللَّهُمَّ يَسِّرْنِي لِلْيُسْرَى، وَجَنِّبْنِي الْعُسْرَى، وَاغْفِرْ',
      count: 1
    },

    {
      title: 'الدُّعَاءُ عِنْدَ صُعُودِ الصَّفَا وَالمَرْوَةِ',
      text: 'نَبْدَأُ بِمَا بَدَأَ بِهِ\nإِنَّ الصَّفَا وَالمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ\nلَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ',
      count: 3
    },

    {
      title: 'الدُّعَاءُ عَلَى الصَّفَا',
      text: 'اللَّهُمَّ إِنَّكَ قُلْتَ: {اِدْعُونِي أَسْتَجِبْ لَكُمْ} وَإِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ، وَإِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي إِلَى الإِسْلاَمِ أَلاَ تَنْزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي، وَأَنَا مُسْلِمٌ.\nاللَّهُمَّ اعْصِمْنَا بِدِينِكَ، وَطَوَاعِيَتِكَ، وَطَوَاعِيَةِ رَسُولِكَ، وَجَنِّبْنَا حُدُودَكَ.\nاللَّهُمَّ اجْعَلْنَا نُحِبُّكَ، وَنُحِبُّ مَلَائِكَتَكَ، وَأَنْبِيَاءَكَ، وَرُسَلَكَ، وَنُحِبُّ عِبَادَكَ الصَّالِحِينَ.\nاللَّهُمَّ حَبِّبْنَا إِلَيْكَ وَإِلَى مَلَائِكَتِكَ، وَإِلَى أَنْبِيَائِكَ، وَرُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ.\nاللَّهُمَّ يَسِّرْنَا لِلْيُسْرَى، وَجَنِّبْنَا وَجَنِّبْنَا الْعُسْرَى، وَاغْفِرْ لَنَا فِي الْآخِرَةِ',
      count: 1
    },

    {
      title: 'الدُّعَاءُ فِي السَّعْيِ بَيْنَ الصَّفَا وَالمَرْوَةِ',
      text: 'رَبِّ اغْفِرْ وَارْحَمْ إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ',
      count: 1
    },

    {
      title: 'الدُّعَاءُ بِعَرَفَات',
      text: 'لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
      count: 1
    },

    {
      title: 'دُعَاءُ السَّلَفِ الصَّالِحِ فِي عَرَفَات',
      text: 'لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.\nاللَّهُمَّ اهْدِنَا بِالْهُدَى، وَزَيِّنَّا بِالتَّقْوَى، وَاغْفِرْ لَنَا فِي الْآخِرَةِ وَالْأُولَى.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَعَطَائِكَ رِزْقًا طَيِّبًا مُبَارَكًا.\nاللَّهُمَّ إِنَّكَ أَمَرْتَ بِالدُّعَاءِ، وَقَضَيْتَ عَلَى نَفْسِكَ بِالِاسْتِجَابَةِ، وَأَنْتَ لَا تُخْلِفُ وَعْدَكَ، وَلَا تَكْذِبُ عَهْدَكَ، اللَّهُمَّ مَا أَحْبَبْتَ مِنْ خَيْرٍ فَحَبِّبْهُ إِلَيْنَا، وَيَسِّرْهُ لَنَا، وَمَا كَرِهْتَ مِنْ شَيْءٍ فَكَرِّهْهُ إِلَيْنَا وَجَنِّبْنَاهُ، وَلَا تَنْزِعْ عَنَّا الْإِسْلَامَ بَعْدَ إِذْ أَعْطَيْتَنَا',
      count: 1
    },

    {
      title: 'الدُّعَاءُ عِنْدَ رَمْيِ جَمْرَةِ العَقَبَةِ عِنْدَ كُلِّ حَصَاةٍ',
      text: 'الله أَكْبَر، الله أَكْبَر، الله أَكْبَر.\nاللَّهُمَّ اجْعَلْهُ حَجًّا مَبْرُورًا وَذَنْبًا مَغْفُورًا',
      count: 1
    },

    {
      title: 'الذِّكْرُ عِنْدَ ذَبْحِ الأَضَاحِي',
      text: 'بسم الله، اللهم تقبل من محمد وآل محمد ومن أمة محمد',
      count: 1
    },

    {
      title: 'دُعَاءُ الرُّجُوعِ مِنَ الحَجِّ أَوِ العُمْرَةِ',
      text: 'الله أَكْبَر، الله أَكْبَر، الله أَكْبَر.\nلَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، سَاجِدُونَ.\nاَللّٰهُمَّ اجْعَلْهُ حَجًّا مَبْرُوْرًا وَسَعْيًا مَشْكُوْرًا وَذَنْبًا مَغْفُوْرًا',
      count: 1
    },
  ],
  },

{
  id: 'toilet',
  name: 'أذكار الخلاء',
  icon: 'Hand',
  azkar: [
    {
      title: 'الذِّكْرُ عِنْدَ دُخُولِ الخَلَاءِ',
      text: '(بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث.',
      count: 1
    },

    {
      title: 'الذِّكْرُ بَعْدَ الخُرُوجِ مِنَ الخَلَاءِ',
      text: 'غُفْـرانَك.',
      count: 1
    },
  ],
},


   {
  id: 'marad',
  name: 'أذكار المريض',
  icon: 'Hand',
  azkar: [
    {
      title: 'ذِكْرٌ لِلْمَرِيضِ عِنْدَ الأَلَمِ',
      text: 'بِسْمِ اللهِ ثلاثًا، ثُمَّ قُلْ سَبْعَ مَرَّاتٍ: أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ',
      count: 1
    },

    {
      title: 'دُعَاءُ الشِّفَاءِ',
      text: 'أَذْهِبِ البَأْسَ، رَبَّ النَّاسِ، وَاشْفِ أَنْتَ الشَّافِي، لا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لا يُغَادِرُ سَقَمًا',
      count: 1
    },

    {
      title: 'ذِكْرُ الحِفْظِ وَالعَافِيَةِ',
      text: 'بِسْمِ اللَّهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ، وَهُوَ السَّمِيعُ العَلِيمُ',
      count: 3
    },

    {
      title: 'دُعَاءُ العَافِيَةِ فِي البَدَنِ وَالسَّمْعِ وَالبَصَرِ',
      text: 'اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي',
      count: 1
    },

    {
      title: 'سُورَةُ الفَاتِحَةِ',
      text: 'بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ * الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ * الرَّحْمَٰنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّينِ * إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ * اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ',
      count: 1
    },

    {
      title: 'آيَةُ الكُرْسِيِّ',
      text: 'اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ',
      count: 1
    },

    {
      title: 'أَوَاخِرُ سُورَةِ البَقَرَةِ',
      text: 'آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ * لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ',
      count: 1
    },

    {
      title: 'سُورَةُ الإِخْلَاصِ',
      text: 'قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ',
      count: 3
    },

    {
      title: 'سُورَةُ الفَلَقِ',
      text: 'قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ',
      count: 3
    },

    {
      title: 'سُورَةُ النَّاسِ',
      text: 'قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَٰهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ',
      count: 3
    },

    {
      title: 'دُعَاءٌ لِلرُّقْيَةِ وَالشِّفَاءِ',
      text: 'رَبَّنَا اللهُ الَّذِي فِي السَّمَاءِ، تَقَدَّسَ اسْمُكَ، أَمْرُكَ فِي السَّمَاءِ وَالأَرْضِ، كَمَا رَحْمَتُكَ فِي السَّمَاءِ فَاجْعَلْ رَحْمَتَكَ فِي الأَرْضِ، اغْفِرْ لَنَا حُوبَنَا وَخَطَايَانَا، أَنْتَ رَبُّ الطَّيِّبِينَ، أَنْزِلْ رَحْمَةً مِنْ رَحْمَتِكَ وَشِفَاءً مِنْ شِفَائِكَ عَلَى هَذَا الوَجَعِ فَيَبْرَأُ',
      count: 3
    },
  ],
},
{
  id: 'dead',
  name: 'أدعية للميت',
  icon: 'Hand',
  azkar: [

    {
      title: 'أدعية للمتوفى (ذكور)',
      text: `اللَّهُمَّ أبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وأدخله الجنّة، وأعذه من عذاب القبر ومن عذاب النّار.

اللَّهُمَّ عامله بما أنت أهله، ولا تعامله بما هو أهله.

اللَّهُمَّ اجزه عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً.

اللَّهُمَّ إن كان محسناً فزد من حسناته، وإن كان مسيئاً فتجاوز عن سيّئاته.

اللَّهُمَّ أدخله الجنّة من غير مناقشة حساب ولا سابقة عذاب.

اللَّهُمَّ آنسه في وحدته وفي وحشته وفي غربته.

اللَّهُمَّ أنزله منزلاً مباركاً وأنت خير المنزلين.

اللَّهُمَّ أنزله منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً.

اللَّهُمَّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.

اللَّهُمَّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة.

اللَّهُمَّ أعذه من عذاب القبر، وجفاف الأرض عن جنبيها.

اللَّهُمَّ املأ قبره بالرّضا والنّور والفسحة والسّرور.

اللَّهُمَّ إنّه في ذمّتك وحبل جوارك، فقِهِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه إنّك أنت الغفور الرّحيم.

اللَّهُمَّ إنّه عبدك وابن عبدك خرج من الدّنيا وسعتها ومحبوبها وأحبّائه فيها إلى ظلمة القبر وما هو لاقيه.

اللَّهُمَّ إنّه كان يشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به.

اللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السؤال.

اللَّهُمَّ إنّه نَزَل بك وأنت خير منزولٍ به، وأصبح فقيراً إلى رحمتك وأنت غنيٌّ عن عذابه.

اللَّهُمَّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين.

اللَّهُمَّ انقله من مواطن الدّود وضيق اللحود إلى جنّات الخلود.

اللَّهُمَّ احمه تحت الأرض، واستره يوم العرض، ولا تخزه يوم يبعثون "يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم".

اللَّهُمَّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم).

اللَّهُمَّ أمّنه من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسه آمنة مطمئنّة، ولقّنه حجّته.

اللَّهُمَّ اجعله في بطن القبر مطمئنّاً وعند قيام الأشهاد آمن، وبجود رضوانك واثق، وإلى أعلى درجاتك سابق.

اللَّهُمَّ اجعل عن يمينه نوراً حتّى تبعثه آمناً مطمئنّاً في نورٍ من نورك.

اللَّهُمَّ انظر إليه نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً.

اللَّهُمَّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم.

اللَّهُمَّ اعف عنه فإنّك القائل "ويعفو عن كثير".

اللَّهُمَّ إنّه جاء ببابك، وأناخ بجنابك، فجد عليه بعفوك وإكرامك وجود إحسانك.

اللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمه رحمةً تطمئنّ بها نفسه، وتقرّ بها عينه.

اللَّهُمَّ احشره مع المتّقين إلى الرّحمن وفداً.

اللَّهُمَّ احشره مع أصحاب اليمين، واجعل تحيّته سلامٌ لك من أصحاب اليمين.

اللَّهُمَّ بشّره بقولك "كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية".

اللَّهُمَّ اجعله من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض.

اللَّهُمَّ لا نزكّيه عليك، ولكنّا نحسبه أنّه أمن وعمل صالحاً، فاجعل له جنّتين ذواتي أفنان بحقّ قولك: "ولمن خاف مقام ربّه جنّتان".

اللَّهُمَّ شفع فيه نبيّنا ومصطفاك، واحشره تحت لوائه، واسقه من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً.

اللَّهُمَّ اجعله في جنّة الخلد "الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا".

اللَّهُمَّ إنّه صبر على البلاء فلم يجزع، فامنحه درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل "إنّما يوفي الصّابرون أجرهم بغير حساب".

اللَّهُمَّ إنّه كان مصلّياً لك، فثبّته على الصّراط يوم تزل الأقدام.

اللَّهُمَّ إنّه كان صائماً لك، فأدخله الجنّة من باب الريّان.

اللَّهُمَّ إنّه كان لكتابك تالياً وسامعاً، فشفّع فيه القرآن، وارحمه من النّيران، واجعله يا رحمن يرتقي في الجنّة إلى آخر آية قرأها أو سمعها، وآخر حرفٍ تلاه.

اللَّهُمَّ ارزقه بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ آية سعادة، وبكلّ سورة سلامة، وبكلّ جزءٍ جزاء.

اللَّهُمَّ ارحمه فإنّه كان مسلماً، واغفر له فإنّه كان مؤمناً، وأدخله الجنّة فإنّه كان بنبيّك مصدّقاً، وسامحه فإنّه كان لكتابك مرتّلاً.

اللَّهُمَّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنا وأنثانا.

اللَّهُمَّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان.

اللَّهُمَّ لا تحرمنا أجره ولا تضللنا بعده.

اللَّهُمَّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين.

اللَّهُمَّ ارحمنا إذا يئس منّا الطبيب، وبكى علينا الحبيب، وتخلّى عنّا القريب والغريب، وارتفع النّشيج والنّحيب.

اللَّهُمَّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات.

اللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناق، وبلغت التراق، وقيل من راق وظنّ أنّه الفراق والتفّت الساق بالساق، إليك يا ربّنا يومئذٍ المساق.

اللَّهُمَّ ارحمنا إذا ورينا التّراب، وغلقت القبور والأبواب، وانفضّ الأهل والأحباب، فإذا الوحشة والوحدة وهول الحساب.

اللَّهُمَّ ارحمنا إذا فارقنا النّعيم، وانقطع النّسيم، وقيل ما غرّك بربّك الكريم.

اللَّهُمَّ ارحمنا إذا أقمنا للسؤال، وخاننا المقال، ولم ينفع جاهٌ ولا مال ولا عيال، وقد حال الحال، وليس إلّا فضل الكبير المتعال.

اللَّهُمَّ ارحمنا إذا نُسي اسمنا، ودَرس رسمنا، وأحاط بنا قسمنا ووسعنا.

اللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر، ولم يذكرنا ذاكر، وما لنا من قوّة ولا ناصر، فلا أمل إلّا في القاهر القادر الغافر، يا من إذا وعد أوفى، وإذا توعّد عفا، وشفّع يا ربّ فينا حبيبنا المصطفى، واجعلنا ممّن صفا ووفا، وبالله اكتفى، يا أرحم الرّاحمين، يا حيّ يا قيّوم، يا بديع السموات والأرض، يا ذا الجلال والإكرام.

اللَّهُمَّ إنّه عبدك وابن عبدك وابن أمتك مات وهو يشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر له إنّك أنت الغفّار.

اللَّهُمَّ لا تحرمنا أجره، ولا تفتنّا بعده، واغفر لنا وله، واجمعنا معه في جنّات النّعيم يا ربّ العالمين.

اللَّهُمَّ أنزل على أهله الصّبر والسلوان وارضهم بقضائك.

اللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد.

اللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى آله وصحبه وسلّم إلى يوم الدّين.`,
      count: 1
    },

    {
      title: 'أدعية للمتوفية (إناث)',
      text: `اللَّهُمَّ أبدلها داراً خيراً من دارها، وأهلاً خيراً من أهلها، وأدخلها الجنّة، وأعذها من عذاب القبر ومن عذاب النّار.

اللَّهُمَّ عاملها بما أنت أهله، ولا تعاملها بما هي أهله.

اللَّهُمَّ اجزها عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً.

اللَّهُمَّ إن كانت محسنةً فزد من حسناتها، وإن كانت مسيئةً فتجاوز عن سيّئاتها.

اللَّهُمَّ أدخلها الجنّة من غير مناقشة حساب ولا سابقة عذاب.

اللَّهُمَّ آنسها في وحدتها وفي وحشتها وفي غربتها.

اللَّهُمَّ أنزلها منزلاً مباركاً وأنت خير المنزلين.

اللَّهُمَّ أنزلها منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً.

اللَّهُمَّ اجعل قبرها روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.

اللَّهُمَّ افسح لها في قبرها مدّ بصرها، وافرش قبرها من فراش الجنّة.

اللَّهُمَّ أعذها من عذاب القبر، وجفاف الأرض عن جنبيها.

اللَّهُمَّ املأ قبرها بالرّضا والنّور والفسحة والسّرور.

اللَّهُمَّ إنّها في ذمّتك وحبل جوارك، فقِها فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر لها وارحمها إنّك أنت الغفور الرّحيم.

اللَّهُمَّ إنّها أمتك وبنت أمتك خرجت من الدّنيا وسعتها ومحبوبيها وأحبائها فيها إلى ظلمة القبر وما هي لاقته.

اللَّهُمَّ إنّها كانت تشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم بها.

اللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمها ولا تعذّبها، وأن تثبّتها عند السؤال.

اللَّهُمَّ إنّها نزلت بك وأنت خير منزولٍ به، وأصبحت فقيرةً إلى رحمتك وأنت غنيٌّ عن عذابها.

اللَّهُمَّ آتها برحمتك ورضاك، وقِها فتنة القبر وعذابه، وآتها برحمتك الأمن من عذابك حتّى تبعثها إلى جنّتك يا أرحم الرّاحمين.

اللَّهُمَّ انقلها من مواطن الدّود وضيق اللحود إلى جنّات الخلود.

اللَّهُمَّ احمها تحت الأرض، واسترها يوم العرض، ولا تخزها يوم يبعثون "يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم".

اللَّهُمَّ يمّن كتابها، ويسّر حسابها، وثقّل بالحسنات ميزانها، وثبّت على الصّراط أقدامها، وأسكنها في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم).

اللَّهُمَّ أمّنها من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسها آمنة مطمئنّة، ولقّنها حجّتها.

اللَّهُمَّ اجعلها في بطن القبر مطمئنّةً وعند قيام الأشهاد آمنةً، وبجود رضوانك واثقةً، وإلى أعلى درجاتك سابقةً.

اللَّهُمَّ اجعل عن يمينها نوراً حتّى تبعثها آمنةً مطمئنّةً في نورٍ من نورك.

اللَّهُمَّ انظر إليها نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً.

اللَّهُمَّ أسكنها فسيح الجنان، واغفر لها يا رحمن، وارحمها يا رحيم، وتجاوز عمّا تعلم يا عليم.

اللَّهُمَّ اعف عنها فإنّك القائل "ويعفو عن كثير".

اللَّهُمَّ إنّها جاءت ببابك، وأناخت بجنابك، فجد عليها بعفوك وإكرامك وجود إحسانك.

اللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمها رحمةً تطمئنّ بها نفسها، وتقرّ بها عينها.

اللَّهُمَّ احشرها مع المتّقين إلى الرّحمن وفداً.

اللَّهُمَّ احشرها مع أصحاب اليمين، واجعل تحيّتها سلامٌ لك من أصحاب اليمين.

اللَّهُمَّ بشّرها بقولك "كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية".

اللَّهُمَّ اجعلها من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض.

اللَّهُمَّ لا نزكّيها عليك، ولكنّا نحسبها أنّها آمنت وعملت صالحاً، فاجعل لها جنّتين ذواتي أفنان بحقّ قولك: "ولمن خاف مقام ربّه جنّتان".

اللَّهُمَّ شفع فيها نبيّنا ومصطفاك، واحشرها تحت لوائه، واسقها من يده الشّريفة شربةً هنيئةً لا تظمأ بعدها أبداً.

اللَّهُمَّ اجعلها في جنّة الخلد "الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا".

اللَّهُمَّ إنّها صبرت على البلاء فلم تجزع، فامنحها درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل "إنّما يوفي الصّابرون أجرهم بغير حساب".

اللَّهُمَّ إنّها كانت تصلّي لك، فثبّتها على الصّراط يوم تزل الأقدام.

اللَّهُمَّ إنّها كانت صائمةً لك، فأدخلها الجنّة من باب الريّان.

اللَّهُمَّ إنّها كانت لكتابك تاليةً وسامعةً، فشفّع فيها القرآن، وارحمها من النّيران، واجعلها يا رحمن ترتقي في الجنّة إلى آخر آية قرأتها أو سمعتها، وآخر حرفٍ تلته.

اللَّهُمَّ ارزقها بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ آية سعادة، وبكلّ سورة سلامة، وبكلّ جزءٍ جزاء.

اللَّهُمَّ ارحمها فإنّها كانت مسلمةً، واغفر لها فإنّها كانت مؤمنةً، وأدخلها الجنّة فإنّها كانت بنبيّك مصدّقةً، وسامحها فإنّها كانت لكتابك مرتّلةً.

اللَّهُمَّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنا وأنثانا.

اللَّهُمَّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان.

اللَّهُمَّ لا تحرمنا أجرها ولا تضللنا بعدها.

اللَّهُمَّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين.

اللَّهُمَّ ارحمنا إذا يئس منّا الطبيب، وبكى علينا الحبيب، وتخلّى عنّا القريب والغريب، وارتفع النّشيج والنّحيب.

اللَّهُمَّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات.

اللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناق، وبلغت التراق، وقيل من راق وظنّ أنّه الفراق والتفّت الساق بالساق، إليك يا ربّنا يومئذٍ المساق.

اللَّهُمَّ ارحمنا إذا ورينا التّراب، وغلقت القبور والأبواب، وانفضّ الأهل والأحباب، فإذا الوحشة والوحدة وهول الحساب.

اللَّهُمَّ ارحمنا إذا فارقنا النّعيم، وانقطع النّسيم، وقيل ما غرّك بربّك الكريم.

اللَّهُمَّ ارحمنا إذا أقمنا للسؤال، وخاننا المقال، ولم ينفع جاهٌ ولا مال ولا عيال، وقد حال الحال، وليس إلّا فضل الكبير المتعال.

اللَّهُمَّ ارحمنا إذا نُسي اسمنا، ودَرس رسمنا، وأحاط بنا قسمنا ووسعنا.

اللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر، ولم يذكرنا ذاكر، وما لنا من قوّة ولا ناصر، فلا أمل إلّا في القاهر القادر الغافر، يا من إذا وعد أوفى، وإذا توعّد عفا، وشفّع يا ربّ فينا حبيبنا المصطفى، واجعلنا ممّن صفا ووفا، وبالله اكتفى، يا أرحم الرّاحمين، يا حيّ يا قيّوم، يا بديع السموات والأرض، يا ذا الجلال والإكرام.

اللَّهُمَّ إنّها أمتك بنت أمتك ماتت وهي تشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر لها إنّك أنت الغفّار.

اللَّهُمَّ لا تحرمنا أجرها، ولا تفتنّا بعدها، واغفر لنا ولها، واجمعنا معها في جنّات النّعيم يا ربّ العالمين.

اللَّهُمَّ أنزل على أهلها الصّبر والسلوان وارضهم بقضائك.

اللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد.

اللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى آله وصحبه وسلّم إلى يوم الدّين.`,
      count: 1
    },

    {
      title: 'أدعية للميت الطفل الصغير (ذكر أو أنثى)',
      text: `اللَّهُمَّ اجْعَلْهُ فَرَطَاً وَذُخْراً لِوَالِدَيْهِ، وَشَفِيعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِينَهُمَا، وَأَعْظِمْ بِهِ أُجُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ الْمُؤْمِنِينَ، وَاجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الجَحِيمِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لِأَسْلَافِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنَا بِالإِيمَانِ.`,
      count: 1
    },

    {
      title: 'الدعاء للميت في صلاة الجنازة',
      text: `اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ، وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ، وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِ.`,
      count: 1
    },
  ],
},
{
  id: 'istikharah',
  name: 'دعاء الاستخارة',
  icon: 'Hand',
  azkar: [
    {
      title: 'دُعَاءُ صَلَاةِ الاِسْتِخَارَةِ',
      text: `قال جابر بن عبدالله رضي الله عنهما:
كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الأمور كلها كما يعلمنا السورة من القرآن، يقول:

إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل:
اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب.

اللهم إن كنت تعلم أن هذا الأمر - ويسمي حاجته - خيراً لي في ديني ومعاشي وعاقبة أمري - أو قال: عاجله وآجله - فأقدره لي ويسره لي ثم بارك لي فيه.

وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري - أو قال: عاجله وآجله - فاصرفه عني واصرفني عنه، واقدر لي الخير حيث كان ثم ارضني به.`,
      count: 1
    },
 
    ],
  },
{
  id: 'jawami',
  name: 'جوامع الدعاء',
  icon: 'Hand',
  azkar: [
    {
      title: 'جوامع الدعاء (1)',
      text: `اللَّهُمَّ يَا بَارِئَ البَرِيَّاتِ، وَغَافِرَ الخَطِيَّاتِ، وَعَالِمَ الخَفِيَّاتِ، المُطَّلِعُ عَلَى الضَّمَائِرِ وَالنِّيَّاتِ، يَا مَنْ أَحَاطَ بِكُلِّ شَيءٍ عِلْماً، وَوَسِعَ كُلّ شَيْءٍ رَحْمَةً، وَقَهَرَ كُلّ مَخْلُوقٍ عِزَّةً وَحُكْماً، اغْفِرْ لِي ذُنُوبِي، وَاسْتُرْ عُيُوبِي، وَتَجَاوَزْ عَنْ سَيِّئَاتِيَ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.

اللَّهُمَّ يَا سَمِيعَ الدَّعَوَاتِ، يَا مُقِيلَ العَثَرَاتِ، يَا قَاضِيَ الحَاجَاتِ، يَا كَاشِفَ الكَرُبَاتِ، يَا رَفِيعَ الدَّرَجَاتِ، وَيَا غَافِرَ الزَّلاَّتِ، اغْفِرْ لِلْمُسْلِمِينَ وَالمُسْلِمَاتِ، وَالمُؤْمِنِينَ وَالمُؤْمِنَاتِ، الأَحْيَاءِ مِنْهُم وَالأَمْوَاتِ، إِنَّكَ سَمِيعٌ قَرِيبٌ مُجِيبُ الدَّعَوَاتِ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ، وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ، أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ، الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ، وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.

اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي.

اللَّهُمَّ رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (2)',
      text: `اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي.

اللَّهُمَّ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي.

اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي فَإِنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ.

اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِي، وَاجْبُرْنِي، وَارْفَعْنِي.

اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ، وَلا تُنْقِصُهُ المَغْفِرَةُ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ، وَهَبْ لَنَا مَا لا يُنْقِصُكَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (3)',
      text: `اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجُلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ.

اللَّهُمَّ إِنَّ ذُنُوبِي عِظَامٌ وَهِي صِغَارٌ فِي جَنْبِ عَفْوِكَ يَا كَرِيمُ، فَاغْفِرْهَا لِي.

اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي فِي دَارِي، وَبَارِكْ لِي فِي رِزْقِي.

اللَّهُمَّ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا، رَبَّنَا وَلا تَحْمِلْ عَلَينَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا، رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ، وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانْصُرْنَا عَلَى القَوْمِ الكَافِرِينَ.

اللَّهُمَّ إِنَّا قَدْ أَطَعْنَاكَ فِي أَحَبِّ الأَشْيَاءِ إِلَيْكَ أَنْ تُطَاعَ فِيهِ، الإِيمَانِ بِكَ، وَالإِقْرَارِ بِكَ، وَلَمْ نَعْصِكَ فِي أَبْغَضِ الأَشْيَاءِ أَنْ تُعْصَى فِيهِ؛ الكُفْرِ وَالجَحْدِ بِكَ، اللَّهُمَّ فَاغْفِرْ لَنَا مَا بَيْنَهُمَا.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (4)',
      text: `اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَعْلَنْتُ وَمَا أَسْرَرْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ لا إِلَهَ إِلاَّ أَنْتَ.

اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأَبْرَارِ.

اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا وَلإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيمَانِ، رَبَّنَا وَسِعْتَ كُلّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الجَحِيمِ.

اللَّهُمَّ أَقِلْ عَثَرَاتِنَا، وَاغْفِرْ زَلاَّتِنَا، وَكَفِّرْ عَنَّا سَيِّئَاتِنَا، وَتَوَفَّنَا مَعَ الأَبْرَارِ.

اللَّهُمَّ بَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالمَاءِ وَالثَّلْجِ وَالبَرَدِ، اللَّهُمَّ نَقِّنِي مِنَ الخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (5)',
      text: `اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدَكَ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الوَاحِدُ الأَحَدُ، الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.

اللَّهُمَّ إِلَهِي: حُجَّتِي حَاجَتِي، وَعُدَّتِي فَاقَتِي، فَارْحَمْنِي.

اللَّهُمَّ إِلَهِي: كَيْفَ أَمْتَنِعُ بِالذَّنْبِ مِنَ الدُّعَاءِ، وَلا أَرَاكَ تَمْنَعُ مَعَ الذَّنْبِ مِنَ العَطَاءِ، فَإِنْ غَفَرْتَ فَخَيْرُ رَاحِمٍ أَنْتَ، وَإِنْ عَذَّبْتَ فَغَيْرُ ظَالِمٍ أَنْتَ.

اللَّهُمَّ إِلَهِي: أَسْأَلُكَ تَذَلُّلاً فَأَعْطِنِي تَفَضُّلاً.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (6)',
      text: `اللَّهُمَّ يَا مَنْ عَلَى العَرْشِ اسْتَوَى، يَا مَنْ خَلَقَ فَسَوَّى وَقَدَّرَ فَهَدَى، وَأَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى، يَا مَنْ أَضْحَكَ وَأَبْكَى، وَأَمَاتَ وَأَحْيَا، وَأَسْعَدَ وَأَشْقَى، وَأَوْجَدَ وَأَبْلَى، وَرَفَعَ وَخَفَضَ، وَأَعَزَّ وَأَذَلَّ، وَأَعْطَى وَمَنَعَ، وَرَفَعَ وَوَضَعَ.

اللَّهُمَّ يَا مَنْ شَقَّ البِحَارَ، وَأَجْرَى الأَنْهَارَ، وَكَوَّرَ النَّهَارَ عَلَى اللَّيلِ وَاللَّيلَ عَلَى النَّهَارِ، يَا مَنْ هَدَى مِنْ ضَلالَةٍ، وَأَنْقَذَ مِنْ جَهَالَةٍ، وَأَنَارَ الأَبْصَارَ، وَأَحْيَا الضَّمَائِرَ وَالأَفْكَارَ.

اللَّهُمَّ اهْدِنَا فِيمَنْ هَدَيْتَ، وَعَافِنَا فِيمَنْ عَافَيْتَ، وَتَوَلَّنَا فِيمَنْ تَوَلَّيْتَ.

اللَّهُمَّ اهْدِنَا الصِّرَاطَ المُسْتَقِيمَ، صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيهِم مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ.

اللَّهُمَّ وَفِّقْنَا لِهُدَاكَ وَاجْعَلْ عَمَلَنَا فِي رِضَاكَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (7)',
      text: `اللَّهُمَّ أَرِنَا الحَقَّ حَقًّا وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ.

اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا.

اللَّهُمَّ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلّ شَيْءٍ قَدِيرٌ.

اللَّهُمَّ حَبِّبْ إلَينَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا، وَكَرِّهِ إلَينَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ.

اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (8)',
      text: `اللَّهُمَّ خُذْ بِنَوَاصِينَا لِلْبِرِّ وَالتَّقْوَى، وَلِمَا تُحِبُّ مِنَ العَمَلِ وَتَرْضَى.

اللَّهُمَّ رَبِّ جِبْرَائِيلَ وَمِيكَائِيلَ وَإسْرَافِيلَ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضَ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنَا لِمَا اخْتُلِفَ فِيهِ مِنَ الحَقِّ بِإِذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ.

اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلاءَ حُزْنِي، وَذَهَابَ هَمِّي.

اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي سَمْعِي نُورًا، وَفِي بَصَرِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ شِمَالِي نُورًا، وَمِنْ بَيْنِ يَدَيَّ نُورًا، وَمِنْ خَلْفِي نُورًا، وَمِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، وَاجْعَلْ لِي نُورًا، وَأَعْظِمْ لِي نُورًا.

اللَّهُمَّ أَغْنِنِي بِالعِلْمِ، وَزَيِّنِّي بِالحِلْمِ، وَأَكْرِمْنِي بِالتَّقْوَى، وَجَمِّلْنِي بِالعَافِيَةِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (9)',
      text: `اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمَ الخَائِفِينَ مِنْكَ، وَخَوْفَ العَالِمِينَ بِكَ، وَيَقِينَ المُتَوَكِّلِينَ عَلَيْكَ، وَتَوَكُّلَ المُوقِنِينَ بِكَ، وَإِنَابَةَ المُخْبِتِينَ إِلَيْكَ، وَإِخْبَاتَ المُنِيبِينَ إِلَيْكَ، وَشُكْرَ الصَّابِرِينَ لَكَ، وَصَبْرَ الشَّاكِرِينَ لَكَ، وَلَحَاقًا بِالأَحْيَاءِ المَرْزُوقِينَ عِنْدَكَ.

اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى وَالسَّدَادَ.

اللَّهُمَّ أَلْهِمْنِي رُشْدِي، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي.

اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي، وَعَلِّمْنِي مَا يَنْفَعُنِي، وَزِدْنِي عِلْمًا.

اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَأَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (10)',
      text: `اللَّهُمَّ ثَبِّتْنِي وَاجْعَلْنِي هَادِيًا مَهْدِيًّا.

اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيكَ تَوَكَّلْتُ، وَإِلَيكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، أَعُوذُ بِعِزَّتِكَ، لا إِلَهَ إِلاَّ أَنْتَ، أَنْ تُضِلَّنِي، أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ.

اللَّهُمَّ اهْدِنِي لأَحْسَنِ الأَخْلاَقِ لا يَهْدِي لأَحْسَنِهَا إِلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لا يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ.

اللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي.

اللَّهُمَّ فَالِقَ الحَبِّ وَالنَّوَى، وَمُخْرِجَ الحَيِّ مِنَ المَيِّتِ وَمُخْرِجَ المَيِّتِ مِنَ الحَيِّ، فَالِقَ الإِصْبَاحِ، وَجَاعِلَ اللَّيلِ سَكَنًا، وَالشَّمْسَ وَالقَمَرَ حُسْبَانًا، يَا مَنْ جَعَلَ لَنَا النُّجُومَ لِنَهْتَدِيَ بِهَا فِي ظُلُمَاتِ البَرِّ وَالبَحْرِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (11)',
      text: `اللَّهُمَّ جَلَّتْ قُدْرَتُكَ، وَتَعَالَتْ حِكْمَتُكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلا إِلَهَ غَيْرُكَ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدَ، لا إِلَهَ إِلاَّ أَنْتَ، المَنَّانُ، بَدِيعُ السَّمَاوَاتِ وَالأَرْضِ، ذُو الجَلالِ وَالإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ.

اللَّهُمَّ ارْزُقْنَا رِزْقًا يَزِيدُنَا لَكَ شُكْرًا، وَإِلَيكَ فَاقَةً وَفَقْرًا، وَبِكَ عَمَّنْ سِوَاكَ غِنًى.

اللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي، وَانْقِطَاعِ عُمُرِي.

اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ فَإِنَّهُ لا يَمْلِكُهَا إِلاَّ أَنْتَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (12)',
      text: `اللَّهُمَّ رَبِّ لا تَذَرْنِي فَرْدًا وَأَنْتَ خَيْرُ الْوَارِثِينَ.

اللَّهُمَّ رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ.

اللَّهُمَّ قَنِّعْنِي بِمَا رَزَقْتَنِي، وَبَارِكْ لِي فِيهِ، وَاخْلُفْ عَلَيَّ كُلّ غَائِبَةٍ لِي مِنْكَ بِخَيرٍ.

اللَّهُمَّ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا.

اللَّهُمَّ يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ بِنُجُومِهَا وَأَبْرَاجِهَا، وَالأَرْضُ بِسُهُولِهَا وَفِجَاجِهَا، وَالبِحَارُ بِأَحْيَائِهَا وَأَمْوَاجِهَا، وَالجِبَالُ بِقِمَمِهَا وَأَوْتَادِهَا، وَالأَشْجَارُ بِفُرُوعِهَا وَثِمَارِهَا، وَالسِّبَاعُ فِي فَلَوَاتِهَا، وَالطَّيْرُ فِي وَكَنَاتِهَا، يَا مَنْ تُسَبِّحُ لَهُ الذَّرَّاتُ عَلَى صِغَرِهَا، وَالمَجَرَّاتُ عَلَى كِبَرِهَا، يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالأَرْضُ وَمَنْ فِيهِنَّ، وَإِنْ مِنْ شَيءٍ إِلاَّ يُسَبِّحُ بِحَمْدِه.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (13)',
      text: `اللَّهُمَّ يَا مَنْ خَلَقَ الأَرْضَ وَالسَّمَاوَاتِ العُلَى، يَا رَحْمَانًا عَلَى العَرْشِ اسْتَوَى، يَا مَنْ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ وَمَا بَيْنَهُمَا، وَمَا تَحْتَ الثَّرَى، يَا مَنْ يَعْلَمُ السِّرَّ وَأَخْفَى، يَا مَنْ لَهُ الأَسْمَاءُ الحُسْنَى، يَا مَنْ مَعَ عِبَادِهِ يَسْمَعُ وَيَرَى، يَا مَنْ أَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى.

اللَّهُمَّ أَنْتَ البَادِئُ بِالإِحْسَانِ مِنْ قَبْلِ تَوَجُّهِ العَابِدِينَ، وَأَنْتَ البَادِئُ بِالعَطَايَا قَبْلَ طَلَبِ الطَّالِبِينَ وَأَنْتَ الوَهَّابُ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ.

اللَّهُمَّ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الجَنَّةِ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (14)',
      text: `اللَّهُمَّ أَحْسِنْ عَاقِبَتِنَا فِي الأُمُورِ كُلِّهَا، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ.

اللَّهُمَّ رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا.

اللَّهُمَّ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ، وَأَسْتَجِيرُ بِكَ مِنَ النَّارِ.

اللَّهُمَّ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلا تُخْزِنَا يَوْمَ القِيَامَةِ إِنَّكَ لا تُخْلِفُ المِيعَادَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (15)',
      text: `اللَّهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا.

اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لا نَعْلَمُهُ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ البَلاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ القَضَاءِ، وَشَمَاتَةِ الأَعْدَاءِ، يَا سَمِيعَ الدُّعَاءِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ القَبْرِ، وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَاتِ، وَمِنْ فِتْنَةِ المَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنَ المَأْثَمِ وَالمَغْرَمِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَفِتْنَةِ القَبْرِ وَعَذَابِ القَبْرِ، وَشَرِّ فِتْنَةِ الغِنَى، وَشَرِّ فِتْنَةِ الفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (16)',
      text: `اللَّهُمَّ اغْسِلْ قَلْبِي بِمَاءِ الثَّلْجِ وَالبَرَدِ، وَنَقِّ قَلْبِيَ مِنَ الخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالمَأْثَمِ وَالمَغْرَمِ.

اللَّهُمَّ رَبِّ جِبْرَائِيلَ، وَمِيكَائِيلَ، وَرَبِّ إِسْرَافِيلَ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ القَبْرِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَارِ السُّوءِ فِي دَارِ المُقَامَةِ، فَإِنَّ جَارَ البَادِيَةِ يَتَحَوَّلُ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالبُخْلِ، وَالهَرَمِ وَالقَسْوَةِ، وَالغَفْلَةِ وَالعَيْلَةِ وَالذِّلَّةِ وَالمَسْكَنَةِ، وَأَعُوذُ بِكَ مِنَ الفَقْرِ وَالكُفْرِ، وَالفُسُوقِ وَالشِّقَاقِ وَالنِّفَاقِ وَالسُّمْعَةِ وَالرِّيَاءِ، وَأَعُوذُ بِكَ مِنَ الصَّمَمِ وَالبَكَمِ وَالجُنُونِ وَالجُذَامِ وَالبَرَصِ وَسَيِّئِ الأَسْقَامِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (17)',
      text: `اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ، وَالبُخْلِ، وَالهَرَمِ، وَعَذَابِ القَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاَهَا.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ، وَمِنْ قَلْبٍ لا يَخْشَعُ، وَمِنْ نَفْسٍ لا تَشْبَعُ، وَمِنْ دَعْوَةٍ لا يُسْتَجَابُ لَهَا.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاَقِ وَالأَعْمَالِ وَالأَهْوَاءِ وَالأَدْوَاءِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ تُحَسِّنَ فِي لَوَائِحِ العُيُونِ عَلانِيَتِي، وَتُقَبِّحَ فِي خَفِيَّاتِ العُيُونِ سَرِيرَتِي، اللَّهُمَّ كَمَا أَسَأْتُ وَأَحْسَنْتَ إِلَيَّ، فَإِذَا عُدْتُ فَعُدْ عَلَيَّ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي، وَمِنْ شَرِّ بَصَرِي، وَمِنْ شَرِّ لِسَانِي، وَمِنْ شَرِّ قَلْبِي، وَمِنْ شَرِّ مَنِيِّي.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (18)',
      text: `اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَقُولَ زُورًا، أَوْ أَغْشَى فُجُورًا، أَوْ أَكُونَ بِكَ مَغْرُورًا.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشِّقَاقِ وَالنِّفَاقِ، وَسُوءِ الأَخْلاقِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَبِكَ مِنْكَ، لا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ.

اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنَزِّلَ التَّوْرَاةِ وَالإِنجِيلِ وَالفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الفَقْرِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَغَلَبَةِ العَدُوِّ، وَشَمَاتَةِ الأَعْدَاءِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (19)',
      text: `اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الفَقْرِ وَالقِلَّةِ وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ الغِنَى، وَمِنْ شَرِّ فِتْنَةِ الفَقْرِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ يَوْمِ السُّوءِ، وَمِنْ لَيْلَةِ السُّوءِ، وَمِنْ سَاعَةِ السُّوءِ، وَمِنْ صَاحِبِ السُّوءِ، وَمِنْ جَارِ السُّوءِ فِي دَارِ المُقَامَةِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لا يَخْشَعُ، وَمِنْ دُعَاءٍ لا يُسْمَعُ، وَمِنْ نَفْسٍ لا تَشْبَعُ، وَمِنْ عِلْمٍ لا يَنْفَعُ، أَعُوذُ بِكَ مِنْ هَؤُلاءِ الأَرْبَعِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (20)',
      text: `اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ التَّرَدِّي، وَالهَدْمِ، وَالغَرَقِ، وَالحَرْقِ، وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيطَانُ عِنْدَ المَوْتِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا، وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا.

اللَّهُمَّ رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونَ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ الأَشْرَارِ، وَمِنْ كَيْدِ الفُجَّارِ، وَمِنْ طَوَارِقِ اللَّيْلِ وَالنَّهَارِ إِلاَّ طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ.

اللَّهُمَّ رَبِّ أَعُوذُ بِكَ مِنْ أَعْيُنِ العَائِنِينَ، وَمِنْ سِحْرِ السَّاحِرِينَ، وَمِنْ شَرِّ كُلِّ ذِي شَرٍّ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الجُوعِ، فَإِنَّهُ بِئْسَ الضَّجِيعُ، وَأَعُوذُ بِكَ مِنَ الخِيَانَةِ، فَإِنَّهَا بِئْسَتِ البِطَانَةُ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (21)',
      text: `اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عُقُوقِ الأَبْنَاءِ، وَمِنْ قَطِيعَةِ الأَقْرِبَاءِ، وَمِنْ جَفْوَةِ الأَحْيَاءِ، وَمِنْ تَغَيُّرِ الأَصْدِقَاءِ، وَمِنْ شَمَاتَةِ الأَعْدَاءِ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ أَزِلَّ أَوْ أُزَلَّ، أَوْ أَضِلَّ أَوْ أُضَلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَمَ، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ.

اللَّهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَهْدِيكَ، وَنَسْتَغْفِرُكَ وَنَتُوبُ إِلَيْكَ وَنُؤمِنُ بِكَ، وَنَتَوَكَّلُ عَلَيْكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ كُلَّهُ، نَشْكُرُكَ وَلا نَكْفُرُكَ، وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ، اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ الجِدَّ بِالكُفَّارِ مُلْحِقٌ.

اللَّهُمَّ رَبَّنَا أَعِزَّنَا بِالإِسْلامِ، وَأَعِزَّ بِنَا الإِسْلامَ، اللَّهُمَّ أَعْلِ بِنَا كَلِمَةَ الإِسْلامِ، وَارْفَعْ بِنَا رَايَةَ القُرْآنِ.

اللَّهُمَّ مُنْزِلَ الكِتَابِ، وَمُجْرِيَ السَّحَابِ، وَهَازِمَ الأَحْزَابِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ، أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ وَإِذَا سُئِلْتَ بِهِ أَعْطَيْتَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (22)',
      text: `اللَّهُمَّ يَا حَيُّ يَا قَيُّومُ، يَا حَيُّ يَا قَيُّومُ، يَا حَيُّ يَا قَيُّومُ، اللَّهُمَّ أَظِلَّنِي فِي ظِلِّ عَرْشِكَ يَوْمَ لا ظِلَّ إِلاَّ ظِلُّكَ.

اللَّهُمَّ أَظْهِرْ دِينَكَ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ المُشْرِكُونَ.

اللَّهُمَّ يَا مَنْ يُجِيبُ المُضْطَرَّ إِذَا دَعَاهُ، وَيَكْشِفُ السُّوءَ، اكْشِفِ السُّوءَ عَنْ إِخْوَانِنَا الأُسَارَى وَالمَسْجُونِينَ وَالمُعْتَقَلِينَ، اللَّهُمَّ افْكُكْ بِقُوَّتِكَ أَسْرَهُمْ، وَاجْبُرْ بِرَحْمَتِكَ كَسْرَهُمْ، وَتَوَلَّ بِعِنَايَتِكَ أَمْرَهُمْ، وَرُدَّهُمْ إِلَى أَهْلِيهِمْ سَالِمِينَ غَانِمِينَ.

اللَّهُمَّ كُنْ لِلْمُسْلِمِينَ وَالمُسْتَضْعَفِينَ فِي كُلِّ مَكَانٍ؛ فَرِّجْ هَمَّهُم، وَنَفِّسْ كَرْبَهُم، وَأَقِلْ عَثْرَتَهُم وَتَوَلَّ بِنَفْسِكَ أَمْرَهُم.

اللَّهُمَّ ارْفَعْ رَايَتَهُم، وَاكْبِتْ عَدُوَّهُمْ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (23)',
      text: `اللَّهُمَّ وَحِّدْ صَفَّهُم، وَاجْمَعْ كَلِمَتَهُم، وَرُدَّهُم إِلَيْكَ رَدًّا جَمِيلاً.

اللَّهُمَّ لا أَبَرَّ بِهِم مِنْكَ، وَلا أَرْحَمَ بِهِم مِنْكَ، وَلا أَرْأَفَ بِهِم مِنْكَ، اللَّهُمَّ هُمْ مِنْكَ وَإِلَيكَ، اللَّهُمَّ فَاجْعَلِ الدَّائِرَةَ لَهُم لا عَلَيهِم وَالنَّصْرَ حَلِيفَهُمْ، يَا رَبِّ.

اللَّهُمَّ يَا خَيْرَ مَنْ سُئِلَ، وَأَجْوَدَ مَنْ أَعْطَى، وَأَكْرَمَ مَنْ عَفَا، وَأَعْظَمَ مَنْ غَفَرَ، وَأَعْدَلَ مَنْ حَكَمَ، وَأَصْدَقَ مَنْ حَدَّثَ، وَأَوْفَى مَنْ وَعَدَ، وَأَبْصَرَ مَنْ رَاقَبَ، وَأَسْرَعَ مَنْ حَاسَبَ، وَأَرْحَمَ مَنْ عَاقَبَ، وَأَحْسَنَ مَنْ خَلَقَ، وَأَحْكَمَ مَنْ شَرَعَ، وَأَحَقَّ مَنْ عُبِدَ، وَأَوْلَى مَنْ دُعِيَ، وَأَبَرَّ مَنْ أَجَابَ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلَةِ، وَخَيْرَ الدُّعَاءِ، وَخَيْرَ النَّجَاحِ، وَخَيْرَ العَمَلِ، وَخَيْرَ الثَّوَابِ، وَخَيْرَ الحَيَاةِ، وَخَيْرَ المَمَاتِ، وَثَبِّتْنِي، وَثَقِّلْ مَوَازِينِي، وَحَقِّقْ إِيمَانِي، وَارْفَعْ دَرَجَاتِي، وَتَقَبَّلْ صَلاَتِي، وَاغْفِرْ خَطِيئَتِي، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ فَوَاتِحَ الخَيْرِ، وَخَوَاتِـمَهُ، وَجَوَامِعَهُ، وَأَوَّلَهُ، وَظَاهِرَهُ، وَبَاطِنَهُ، وَالدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (24)',
      text: `اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ مَا آتِي، وَخَيْرَ مَا أَفْعَلُ، وَخَيْرَ مَا أَعْمَلُ، وَخَيْرَ مَا بَطَنَ، وَخَيْرَ مَا ظَهَرَ، وَالدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَرْفَعَ ذِكْرِي، وَتَضَعَ وِزْرِي، وَتُصْلِحَ أَمْرِي، وَتُطَهِّرَ قَلْبِي، وَتُحَصِّنَ فَرْجِي، وَتُنَوِّرَ قَلْبِي، وَتَغْفِرَ لِي ذَنْبِي، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تُبَارِكَ فِي نَفْسِي، وَفِي سَمْعِي، وَفِي بَصَرِي، وَفِي رُوحِي، وَفِي خَلْقِي، وَفِي خُلُقِي، وَفِي أَهْلِي، وَفِي مَحْيَايَ، وَفِي مَمَاتِي، وَفِي عَمَلِي، فَتَقَبَّلْ حَسَنَاتِي، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.

اللَّهُمَّ لَكَ الحَمْدُ كُلُّهُ، اللَّهُمَّ لا قَابِضَ لِمَا بَسَطْتَ، وَلا بَاسِطَ لِمَا قَبَضْتَ، وَلا هَادِيَ لِمَنْ أَضْلَلْتَ وَلا مُضِلَّ لِمَنْ هَدَيْتَ، وَلا مُعْطِي لِمَا مَنَعْتَ وَلا مَانِعَ لِمَا أَعْطَيْتَ، وَلا مُقَرِّبَ لِمَا بَاعَدْتَ، وَلا مُبَاعِدَ لِمَا قَرَّبْتَ، اللَّهُمَّ ابْسُطْ عَلَينَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ المُقِيمَ الَّذِي لا يَحُولُ وَلا يَزُولُ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ العَيْلَةِ وَالأَمْنَ يَوْمَ الخَوْفِ، اللَّهُمَّ إِنِّي عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَنَا.

اللَّهُمَّ حَبِّبْ إِلَينَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا وَكَرِّهْ إِلَيْنَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ، اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ، وَأَحْينَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيرَ خَزَايَا وَلا مَفْتُونِينَ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ، وَيَصُدُّونَ عَنْ سَبِيلِكَ، وَاجْعَلْ عَلَيهِم رِجْزَكَ وَعَذَابَكَ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ أُوتُوا الكِتَابَ، إِلَهَ الحَقِّ، آمِينَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (25)',
      text: `اللَّهُمَّ بِعِلْمِكَ الغَيبِ، وَقُدْرَتِكَ عَلَى الخَلْقِ؛ أَحْيِنِي مَا عَلِمْتَ الحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الوَفَاةَ خَيْرًا لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الحَقِّ فِي الرِّضَا وَالغَضَبِ، وَأَسْأَلُكَ القَصْدَ فِي الغِنَى وَالفَقْرِ، وَأَسْأَلُكَ نَعِيمًا لا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَا بَعْدَ القَضَاءِ، وَأَسْأَلُكَ بَرْدَ العَيْشِ بَعْدَ المَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الخَيْرَاتِ، وَتَرْكَ المُنْكَرَاتِ، وَحُبَّ المَسَاكِينِ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي، وَإِذَا أَرَدْتَ فِتْنَةَ قَوْمٍ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ، وَأَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَحُبَّ كُلِّ عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّكَ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الخَيْرِ كُلِّهِ، عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ بِكَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (26)',
      text: `اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغْنَا بِهِ جَنَّتَكَ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا، اللَّهُمَّ مَتِّعْنَا بِأَسْمَاعِنَا، وَأَبْصَارِنَا، وَقُوَّاتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلا تَجْعَلْ الدُّنْيَا أَكْبَرَ هَمِّنَا، وَلا مَبْلَغَ عِلْمِنَا، وَلا تُسَلِّطْ عَلَيْنَا مَنْ لا يَرْحَمْنَا.

اللَّهُمَّ إِنَّا نَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَالسَّلامَةَ مِنْ كُلِّ إِثْمٍ، وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ، وَالفَوْزَ بِالجَنَّةِ، وَالنَّجَاةَ مِنَ النَّارِ.

اللَّهُمَّ لا تَدَعْ لَنَا ذَنْبًا إِلاَّ غَفَرْتَهُ، وَلا هَمًّا إِلاَّ فَرَّجْتَهُ، وَلا دَيْنًا إِلاَّ قَضَيْتَهُ، وَلا مَرِيضًا إِلاَّ شَفَيْتَهُ، وَلا مُبْتَلًى إِلاَّ عَافَيْتَهُ، وَلا ضَالاً إِلاَّ هَدَيْتَهُ، وَلا غَائِبًا إِلاَّ رَدَدْتَهُ، وَلا مَظْلُومًا إِلاَّ نَصَرْتَهُ، وَلا أَسِيرًا إِلاَّ فَكَكْتَهُ، وَلا مَيِّتًا إِلاَّ رَحِمْتَهُ، وَلا حَاجَةً لَنَا فِيهَا صَلاحٌ وَلَكَ فِيهَا رِضًا إِلاَّ قَضَيْتَهَا وَيَسَّرْتَهَا بِفَضْلِكَ يَا أَكْرَمَ الأَكْرَمِينَ.

اللَّهُمَّ رَبِّ أَعِنِّي وَلا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلا تَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الهُدَى إِلَيَّ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ.

اللَّهُمَّ رَبِّ اجْعَلْنِي لَكَ شَكَّارًا، لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مِطْوَاعًا، إِلَيْكَ مُخْبِتًا أَوَّاهًا مُنِيبًا، رَبِّ تَقَبَّلْ تَوْبَتِي، وَاغْسِلْ حَوْبَتِي، وَأَجِبْ دَعْوَتِي، وَثَبِّتْ حُجَّتِي، وَاهْدِ قَلْبِي، وَسَدِّدْ لِسَانِي، وَاسْلُلْ سَخِيمَةَ قَلْبِي.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (27)',
      text: `اللَّهُمَّ إِنَّا نَسْألكَ يُسْرًا لَيْسَ بَعْدَهُ عُسْرٌ، وَغِنًى لَيْسَ بَعْدَهُ فَقْرٌ، وَأَمْنًا لَيْسَ بَعْدَهُ خَوْفٌ، وَسَعَادَةً لَيْسَ بَعْدَهَا شَقَاءٌ.

اللَّهُمَّ أَلِّفْ بَيْنَ قُلُوبِنَا، وَأَصْلِحْ ذَاتَ بَيْنِنَا، وَاهْدِنَا سُبُلَ السَّلامِ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ، وَجَنِّبْنَا الفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَبَارِكْ لَنَا فِي أَسْمَاعِنَا، وَأَبْصَارِنَا، وَقُلُوبِنَا، وَأَزْوَاجِنَا، وَذُرِّيَّاتِنَا، وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ، وَاجْعَلْنَا شَاكِرِينَ لِنِعَمِكَ مُثْنِينَ بِهَا عَلَيْكَ قَابِلِينَ لَهَا وَأَتْمِمْهَا عَلَيْنَا.

اللَّهُمَّ يَا مُقَلِّبَ القُلُوبِ وَالأَبْصَارِ، ثَبِّتْ قُلُوبَنَا عَلَى طَاعَتِكَ، وَلا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا، وَلا تَفْتِنَّا فِي دِينِنَا، وَاجْعَلْ يَوْمَنَا خَيْرًا مِنْ أَمْسِنَا، وَاجْعَلْ غَدَنَا خَيْرًا مِنْ يَوْمِنَا، وَاجْعَلْ خَيْرَ أَعْمَارِنَا أَوَاخِرَهَا، وَخَيْرَ أَعْمَالِنَا خَوَاتِيمَهَا، وَخَيْرَ أَيَّامِنَا يَوْمَ نَلْقَاكَ وَأَنْتَ رَاضٍ عَنَّا.

اللَّهُمَّ أَنْتَ الَّذِي خَلَقْتَنِي فَأَنْتَ تَهْدِينِ، وَأَنْتَ الَّذِي تُطْعِمُنِي وَتَسْقِينِ، وَإِذَا مَرِضْتُ فَأَنْتَ تَشْفِينِ، وَأَنْتَ الَّذِي تُمِيتُنِي ثُمَّ تُحْيِينِ، وَأَنْتَ الَّذِي أَطْمَعُ أَنْ يَغْفِرَ لِي خَطِيئَتِي يَوْمَ الدِّينِ، رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ، وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الآخِرِينَ، وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ، وَاغْفِرْ لآبَائِنَا وَأُمَّهَاتِنَا مِنَ المُسْلِمِينَ، وَلا تُخْزِنِي يَوْمَ يُبْعَثُونَ، يَوْمَ لا يَنْفَعُ مَالٌ وَلا بَنُونَ، إِلاَّ مَنْ أَتَى اللهَ بِقَلْبٍ سَلِيمٍ.

اللَّهُمَّ احْفَظْنِي بِالإِسْلاَمِ قَائِمًا، وَاحْفَظْنِي بِالإِسْلاَمِ قَاعِدًا، وَاحْفَظْنِي بِالإِسْلامِ رَاقِدًا، وَلا تُشْمِتْ بِي عَدُوًّا وَلا حَاسِدًا.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (28)',
      text: `اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ، وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَدِكَ.

اللَّهُمَّ يَا ذَا الحَبْلِ الشَّدِيدِ، وَالأَمْرِ الرَّشِيدِ، أَسْأَلُكَ الأَمْنَ يَوْمَ الوَعِيدِ، وَالجَنَّةَ دَارَ الخُلُودِ، مَعَ المُقَرَّبِينَ الشُّهُودِ، الرُّكَّعِ السُّجُودِ، المُوفِينَ بِالعُهُودِ، إِنَّكَ رَحِيمٌ وَدُودٌ، وَإِنَّكَ تَفْعَلُ مَا تُرِيدُ.

اللَّهُمَّ اجْعَلْنَا هَادِينَ مُهْتَدِينَ، غَيْرَ ضَالِّينَ وَلا مُضِلِّينَ، سِلْمًا لأَوْلِيَائِكَ، وَحَرْبًا عَلَى أَعْدَائِكَ، نُحِبُّ بِحُبِّكَ مَنْ أَحَبَّكَ، وَنُعَادِي بِعَدَاوَتِكَ مَنْ خَالَفَكَ. اللَّهُمَّ هَذَا الدُّعَاءُ وَمِنْكَ الإِجَابَةُ، اللَّهُمَّ هَذَا الجُهْدُ وَعَلَيْكَ التُّكْلانُ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا لا يَرْتَدُّ، وَنَعِيمًا لا يَنْفَدُ، وَمُرَافَقَةَ نَبِيِّكَ مُحَمَّدٍ فِي أَعْلَى جَنَّةِ الخُلْدِ.

اللَّهُمَّ آتِنِي الحِكْمَةَ الَّتِي مَنْ أُوتِيَهَا فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (29)',
      text: `اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.

اللَّهُمَّ ارْحَمْنِي، فَأَنْتَ خَيْرُ الرَّاحِمِينَ، وَارْزُقْنِي، فَأَنْتَ خَيْرُ الرَّازِقِينَ، وَاغْفِرْ لِي فَأَنْتَ خَيْرُ الغَافِرِينَ، وَانْصُرْنِي، فَأَنْتَ خَيْرُ النَّاصِرِينَ.

اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لا إِلَهَ إِلاَّ أَنْتَ.

اللَّهُمَّ زِدْنَا وَلا تَنْقُصْنَا، وَأَكْرِمْنَا وَلا تُهِنَّا، وَأَعْطِنَا وَلا تَحْرِمْنَا، وَآثِرْنَا وَلا تُؤْثِرْ عَلَينَا، وَأَرْضِنَا وَارْضَ عَنَّا.

اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً نَقِيَّةً، وَمِيتَةً سَوِيَّةً، وَمَرَدًّا غَيْرَ مُخْزٍ وَلا فَاضِحٍ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (30)',
      text: `اللَّهُمَّ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ، وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ، وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ وَالمُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى، وَالتُّقَى، وَالعَفَافَ وَالغِنَى.

اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً.

اللَّهُمَّ اغْفِرْ لِي، وَاهْدِنِي وَارْزُقْنِي، وَعَافِنِي، أَعُوذُ بِاللهِ مِنْ ضِيقِ المَقَامِ يَوْمَ القِيَامَةِ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (31)',
      text: `اللَّهُمَّ قِنِي شَرَّ نَفْسِي، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي، اللَّهُمَّ اغْفِرْ لِي مَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ وَمَا أَخْطَأْتُ، وَمَا عَمَدْتُ، وَمَا عَلِمْتُ، وَمَا جَهِلْتُ.

اللَّهُمَّ أَكْثِرْ مَالِي، وَوَلَدِي، وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي، وَأَطِلْ حَيَاتِي عَلَى طَاعَتِكَ، وَأَحْسِنْ عَمَلِي وَاغْفِرْ لِي.

اللَّهُمَّ اسْتُرْ عَوَرَاتِي، وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.

اللَّهُمَّ أَكْرِمْنِي وَلا تُهِنِّي، وَأَعْطِنِي وَلا تَحْرِمْنِي، وَزِدْنِي وَلا تَنْقُصْنِي، وَآثِرْنِي وَلا تُؤْثِرْ عَلَيَّ، وَارْضَ عَنِّي وَأَرْضِنِي.

اللَّهُمَّ افْتَحْ لَنَا فَتْحًا مُبِينًا، وَاهْدِنَا صِرَاطًا مُسْتَقِيمًا، وَانْصُرْنَا نَصْرًا عَزِيزًا، وَأَتِمَّ عَلَيْنَا نِعْمَتَكَ، وَأَنْزِلْ فِي قُلُوبِنَا سَكِينَتَكَ، وَانْشُرْ عَلَيْنَا فَضْلَكَ وَرَحْمَتَكَ.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (32)',
      text: `اللَّهُمَّ أَعِنَّا عَلَى شَهَوَاتِ أَنْفُسِنَا، وَقَسْوَةِ قُلُوبِنَا، وَضَعْفِ إِرَادَتِنَا، وَلا تَكِلْنَا إِلَى أَنْفُسِنَا وَلا إِلَى أَحَدٍ غَيْرِكَ.

اللَّهُمَّ لا تَكِلْنَا إِلَى أَنْفُسِنَا طَرْفَةَ عَيْنٍ وَلا أَقَلَّ مِنْ ذَلِكَ.

اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.

اللَّهُمَّ اشْغَلْ قُلُوبَنَا بِحُبِّكَ، وَأَلْسِنَتَنَا بِذِكْرِكَ، وَأَبْدَانِنَا بِطَاعَتِكَ، وَعُقُولَنَا بِالتَّفَكُّرِ فِي خَلْقِكَ وَالتَّفَقُّهِ فِي دِينِكَ.

اللَّهُمَّ اشْفِ مَرْضَانَا، وَارْحَمْ مَوْتَانَا، وَعَافِ مُبْتَلاَنَا، وَفُكَّ أَسْرَانَا، وَاجْبُرْ كَسْرَانَا.`,
      count: 1
    },

    {
      title: 'جوامع الدعاء (33)',
      text: `اللَّهُمَّ أَطْعِمْنَا مِنْ جُوعٍ، وَآمِنَّا مِنْ خَوْفٍ، وَقَوِّنَا مِنْ ضَعْفٍ، وَعَلِّمْنَا مِنْ جَهَالَةٍ، وَأَنْقِذْنَا مِنْ ضَلالَةٍ.

اللَّهُمَّ اخْتِمْ بِالصَّالِحَاتِ أَعْمَالَنَا، وَبِالسَّعَادَةِ آجَالَنَا، وَبَلِّغْنَا مِمَّا يُرْضِيكَ آمَالَنَا.

اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ.

اللَّهُمَّ اجْعَلْ خَيْرَ عُمُرِي أَوَاخِرَهُ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ، وَخَيْرَ أَيَّامِي يَوْمَ لِقَاكَ.

اللَّهُمَّ احْفَظْنِي بِالإِسْلامِ قَائِمًا، وَاحْفَظْنِي بِالإِسْلامِ قَاعِدًا، وَاحْفَظْنِي بِالإِسْلامِ رَاقِدًا، وَلا تُشْمِتْ بِيَ عَدُوًّا وَلا حَاسِدًا.

اللَّهُمَّ أَحْيِنَا مُسْلِمِينَ، وَتَوَفَّنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ.

اللَّهُمَّ أَبْرِمْ لِهَذِهِ الأُمَّةِ أَمْرَ رُشْدٍ، يُعَزُّ فِيهِ أَهْلُ طَاعَتِكَ، وَيُذَلُّ فِيهِ أَهْلُ مَعْصِيَتِكَ، وَيُؤمَرُ فِيهِ بِالمَعْرُوفِ، وَيُنْهَى فِيهِ عَنِ المُنْكَرِ.

اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى عَبْدِكَ وَرَسُولِكَ مُحَمَّدٍ، وَعَلَى آلِهِ وَصَحْبِهِ أَجْمَعِينَ.`,
      count: 1
    },
    ],
  },
{
  id: 'khatm-quran',
  name: 'دُعَاءُ خَتْمِ القُرْآنِ الكَريمِ',
  icon: 'BookOpen',
  azkar: [
    {
      title: 'دُعَاءُ خَتْمِ القُرْآنِ ',
      text: `اللَّهُمَّ ارْحَمْنِي بِالقُرْآنِ وَاجْعَلْهُ لِي إِمَامًا وَنُورًا وَهُدًى وَرَحْمَةً.

اللَّهُمَّ ذَكِّرْنِي مِنْهُ مَا نَسِيتُ، وَعَلِّمْنِي مِنْهُ مَا جَهِلْتُ، وَارْزُقْنِي تِلَاوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ، وَاجْعَلْهُ لِي حُجَّةً يَا رَبَّ العَالَمِينَ.

اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ.

اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ، وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ فِيهِ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً هَنِيَّةً، وَمِيتَةً سَوِيَّةً، وَمَرَدًّا غَيْرَ مُخْزٍ وَلَا فَاضِحٍ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلَةِ، وَخَيْرَ الدُّعَاءِ، وَخَيْرَ النَّجَاحِ، وَخَيْرَ العِلْمِ، وَخَيْرَ العَمَلِ، وَخَيْرَ الثَّوَابِ، وَخَيْرَ الحَيَاةِ، وَخَيْرَ المَمَاتِ، وَثَبِّتْنِي، وَثَقِّلْ مَوَازِينِي، وَحَقِّقْ إِيمَانِي، وَارْفَعْ دَرَجَتِي، وَتَقَبَّلْ صَلَاتِي، وَاغْفِرْ خَطِيئَاتِي، وَأَسْأَلُكَ العُلَا مِنَ الجَنَّةِ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمِ مَغْفِرَتِكَ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ، وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ، وَالفَوْزَ بِالجَنَّةِ، وَالنَّجَاةَ مِنَ النَّارِ.

اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ.

اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعْصِيَتِكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهَا جَنَّتَكَ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلَا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلَا تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا، وَلَا مَبْلَغَ عِلْمِنَا، وَلَا تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا.

اللَّهُمَّ لَا تَدَعْ لَنَا ذَنْبًا إِلَّا غَفَرْتَهُ، وَلَا هَمًّا إِلَّا فَرَّجْتَهُ، وَلَا دَيْنًا إِلَّا قَضَيْتَهُ، وَلَا حَاجَةً مِنْ حَوَائِجِ الدُّنْيَا وَالآخِرَةِ إِلَّا قَضَيْتَهَا يَا أَرْحَمَ الرَّاحِمِينَ.

رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ، وَصَلَّى اللهُ عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ وَأَصْحَابِهِ الأَخْيَارِ، وَسَلَّمَ تَسْلِيمًا كَثِيرًا.`,
      count: 1
   },
    ],
  },



  {
    id: 'tasabih',
    name: 'تسابيح',
    icon: 'Star',
    azkar: [
     {
      text: `سُبْحَانَ اللَّهِ`,
      count: 100,
      fadl: 'يكتب له ألف حسنة أو يحط عنه ألف خطيئة.'
    },
    {
      text: `سُبْحَانَ اللَّهِ وَبِحَمْدِهِ`,
      count: 100,
      fadl: 'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.'
    },
    {
      text: `سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ`,
      count: 100,
      fadl: 'تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.'
    },
    {
      text: `سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ`,
      count: 100,
      fadl: 'غرست له نخلة في الجنة (أى عدد).'
    },
    {
      text: `سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ`,
      count: 100,
      fadl: 'ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).'
    },
    {
      text: `لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.`,
      count: 100,
      fadl: 'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.'
    },
    {
      text: `لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ`,
      count: 100,
      fadl: 'كنز من كنوز الجنة (أى عدد).'
    },
    {
      text: `الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ`,
      count: 100,
      fadl: 'تملأ ميزان العبد بالحسنات.'
    },
    {
      text: `الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد`,
      count: 100,
      fadl: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.'
    },
    {
      text: `أستغفر الله`,
      count: 100,
      fadl: 'لفعل الرسول صلى الله عليه وسلم.'
    },
    {
      text: `سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ`,
      count: 100,
      fadl: 'أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.'
    },
    {
      text: `لَا إِلَهَ إِلَّا اللَّهُ`,
      count: 100,
      fadl: 'أفضل الذكر لا إله إلاّ الله.'
    },
    {
      text: `الْلَّهُ أَكْبَرُ`,
      count: 100,
      fadl: 'من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.'
    },
    {
      text: `سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي.`,
      count: 100,
      fadl: 'خير الدنيا والآخرة'
    },
    {
      text: `الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ.`,
      count: 100,
      fadl: 'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏"‏لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا"‏.'
    },
    {
      text: `اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً.`,
      count: 100,
      fadl: 'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ".'
    },
    {
      text: `اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.`,
      count: 100,
      fadl: 'في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).'
    }
    ],
  },
  {
    id: 'ruqyah',
    name: 'الرقية الشرعية',
    icon: 'Shield',
    azkar: [
      
    {
      text: `بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿1﴾ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ﴿2﴾ الرَّحْمَنِ الرَّحِيمِ ﴿3﴾ مَالِكِ يَوْمِ الدِّينِ ﴿4﴾ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ﴿5﴾ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ﴿6﴾ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ﴿7﴾. [الفاتحة: 1-7]`,
      count: 1
    },
    {
      text: `الم ﴿1﴾ ذَلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ ﴿2﴾ الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ ﴿3﴾ وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآَخِرَةِ هُمْ يُوقِنُونَ ﴿4﴾ أُولَئِكَ عَلَى هُدًى مِنْ رَبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ ﴿5﴾. [البقرة: 1-5]`,
      count: 1
    },
    {
      text: `اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]`,
      count: 1
    },
    {
      text: `لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ﴿284﴾ آَمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آَمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ﴿285﴾ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ﴿286﴾. [البقرة: 284-286]`,
      count: 1
    },
    {
      text: `قُلْ يَا أَيُّهَا الْكَافِرُونَ ﴿1﴾ لَا أَعْبُدُ مَا تَعْبُدُونَ ﴿2﴾ وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿3﴾ وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ ﴿4﴾ وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿5﴾ لَكُمْ دِينُكُمْ وَلِيَ دِينِ ﴿6﴾. [الكافرون]`,
      
      count: 1
    },
    {
      text: `قُلْ هُوَ اللَّهُ أَحَدٌ ﴿1﴾ اللَّهُ الصَّمَدُ ﴿2﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ ﴿3﴾ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ﴿4﴾. [الإخلاص]`,
      count: 1
    },
    {
      text: `قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿1﴾ مِنْ شَرِّ مَا خَلَقَ ﴿2﴾ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿3﴾ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ﴿4﴾ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿5﴾. [الفلق]`,
      count: 1
    },
    {
      text: `قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿1﴾ مَلِكِ النَّاسِ ﴿2﴾ إِلَهِ النَّاسِ ﴿3﴾ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿4﴾ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿5﴾ مِنَ الْجِنَّةِ وَالنَّاسِ ﴿6﴾. [الناس]`,
      count: 1
    },
    {
      text: `أَعُوذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ.`,
      count: 1
    },
    {
      text: `أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ.`,
      count: 1
    },
    {
      text: `أعوذُ بكلماتِ اللهِ التامَّةِ ، مِن كُلِّ شيطانٍ وهامَّةٍ ، ومِن كُلِّ عَيْنٍ لامَّةٍ.`,
      count: 1
    },
    {
      text: `أعوذُ بكلماتِ اللهِ التامَّاتِ مِن شرِّ ما خَلق.`,
      count: 1
    },
    {
      text: `بِسْمِ اللَّهِ أَرْقِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ، مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنٍ حَاسِدٍ، اللَّهُ يَشْفِيكَ، بِسْمِ اللَّهِ أَرْقِيكَ.`,
      count: 1
    },
    {
      text: `بِسْمِ اللَّهِ (ثَلَاثًا)، أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ (سَبْعَ مَرَّاتٍ).`,
      count: 1
    },
    {
      text: `أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ، أَنْ يُعَافِيَكَ وَيَشْفِيَكَ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ ربَّ النَّاسِ، أَذْهِب الْبَأسَ، واشْفِ، أَنْتَ الشَّافي لا شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفاءً لا يُغَادِرُ سقَماً.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ اشْفِ عَبْدَكَ، وصَدِّقْ رَسُولَك.`,
      count: 1
    },
    {
      text: `اللهُمَّ بَارِكْ عَلَيْهِ، وَأَذْهِبْ عَنْهُ حَرَّ الْعَيْنِ وَبَرْدَهَا وَوَصَبَهَا.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صلى الله عليه وسلم وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صلى الله عليه وسلم وَأَنْتَ الْمُسْتَعَانُ، وَعَلَيْكَ الْبَلَاغُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ.`,
      count: 1
    },
    {
      text: `لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْكَرِيمِ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْعَرْشِ الْعَظِيمِ.`,
      count: 1
    },
    {
      text: `رَبّنَا الَّلهُ الذِي فِي السَّمَاءِ، تَقَدَّسَ اسمُكَ، أَمرُكَ فِي السَّمَاءِ وَالأَرْضِ، كَمَا رَحمَتُكَ فِي السَّمَاءِ فَاجْعَلْ رَحْمَتَكَ فِي الأَرْضِ، اغْفِر لَنَا حَوْبَنَا وَخَطَايَانَا، أَنتَ رَبُّ الطَّيِّبِينَ، أَنزِلْ رَحْمَةً مِن رَحمَتِكَ، وَشِفَاءً مِن شِفَائِكَ عَلَى هَذَا الوَجَعِ، فَيَبرَأ. (ثلاث مرات).`,
      count: 3
    },
    {
      text: `أَعُوذُ بِوَجْهِ اللَّهِ الْكَرِيمِ، وَبِكَلِمَاتِ اللَّهِ التَّامَّاتِ، اللَّاتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَلَا فَاجِرٌ، مِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ وَشَرِّ مَا يُعْرُجُ فِيهَا، وَشَرِّ مَا ذَرَأَ فِي الْأَرْضِ وَشَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ طَوَارِقِ اللَّيْلِ وَالنَّهَارِ، إِلَّا طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ .`,
      count: 1
    },
    {
      text: `بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.`,
      count: 3
    },
    {
      text: `أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ غَضَبِهِ وَعِقَابِهِ ، وَشَرِّ عِبَادِهِ ، وَمَنْ هَمَزَاتِ الشَّيَاطِينِ ، وَأَنْ يَحْضُرُونِ.`,
      count: 1
    },
    {
      text: `بِسْمِ اللَّهِ الْعَظِيمِ ، أَعُوذُ بِاللَّهِ الْكَبِيرِ مِنْ شَرِّ كُلِّ عِرْقٍ نَعَّارٍ ، وَمِنْ شَرِّ حَرِّ النَّارِ.`,
      count: 1
    },
    {
      text: `بِسْمِ اللهِ تربَةُ أَرْضِنَا، بِرِيقةِ بَعْضِنَا، يُشْفَى سَقِيمُنَا، بإِذْنِ رَبِّنَا.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلَّا أَنْتَ، الْمَنَّانُ يَا بَدِيعَ السَّمَاوَاتِ وَالْأَرْضِ، يَا ذَا الْجَلَالِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّه لاَ إِلَهَ إِلاَّ أَنْتَ، الأَحَدُ، الصَّمَدُ، الَّذِي لَمْ يَلِدْ، وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.`,
      count: 1
    },
    {
      text: `أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ، أَنْ يُعَافِيَكَ وَيَشْفِيَكَ.`,
      count: 7
    },
    {
      text: `اللَّهُمَّ بَرِّدْ قَلْبِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ ، اللَّهُمَّ نَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ وَكَلِمَاتِكَ التَّامَّةِ مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ، اللَّهُمَّ لَا يُهْزَمُ جُنْدُكَ، وَلَا يُخْلَفُ وَعْدُكَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ، سُبْحَانَكَ وَبِحَمْدِكَ.`,
      count: 1
    },
    {
      text: `بِاسْمِ اللَّهِ يُبْرِيكَ، وَمِنْ كُلِّ دَاءٍ يَشْفِيكَ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ، وَشَرِّ كُلِّ ذِي عَيْنٍ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ اشْفِ عَبْدَكَ يَنْكَأُ لَكَ عَدُوًّا ، أَوْ يَمْشِي لَكَ إِلَى صَلاةٍ.`,
      count: 1
    },
    {
      text: `اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ.`,
      count: 1
    }
    ],
  },
  
  {
  id: 'misc-azkar',
  name: 'أذكار متفرقة',
  icon: 'hand',
  azkar: [
    {
      title: 'دعاء لبس الثوب',
      text: `الحمدُ للهِ الّذي كَساني هذا الثّوبَ وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة.`,
      count: 1
    },
    {
      title: 'دعاء لبس الثوب الجديد',
      text: `اللهم لك الحمد أنت كسوتنيه، أسألك من خيره.`,
      count: 1
    },
    {
      title: 'دعاء الكرب',
      text: `لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض ورب العرش الكريم.

اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله، لا إله إلا أنت.

لا إله إلا أنت سبحانك إني كنت من الظالمين.

الله الله رب لا أشرك به شيئًا.`,
      count: 1
    },
    {
      title: 'دعاء الهم والحزن',
      text: `اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماضٍ في حكمك، عدلٌ في قضاؤك، أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك، أو علمته أحدًا من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي، ونور صدري وجلاء حزني وذهاب همي.

اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن، وضلع الدين وغلبة الرجال.`,
      count: 1
    },
    {
      title: 'دعاء قضاء الدين',
      text: `اللهم اكفني بحلالك عن حرامك وأغنني بفضلك عمن سواك.`,
      count: 1
    },
    {
      title: 'دعاء الريح',
      text: `اللهم إني أسألك خيرها، وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها، وشر ما فيها وشر ما أرسلت به.`,
      count: 1
    },
    {
      title: 'دعاء الرعد',
      text: `سبحان الله الذي يسبح الرعد بحمده والملائكة من خيفته.`,
      count: 1
    },
    {
      title: 'دعاء زيارة القبور',
      text: `السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون، ويرحم الله المستقدمين منا والمستأخرين، أسأل الله لنا ولكم العافية.`,
      count: 1
    },
    {
      title: 'دعاء نزول المطر',
      text: `اللهم صيّبًا نافعًا.`,
      count: 1
    },
    {
      title: 'دعاء ركوب الدابة أو ما يقوم مقامها',
      text: `بسم الله، الحمد لله، سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون، الحمد لله، الحمد لله، الحمد لله، الله أكبر، الله أكبر، الله أكبر، سبحانك اللهم إني ظلمت نفسي فاغفر لي، فإنه لا يغفر الذنوب إلا أنت.`,
      count: 1
    },
    {
      title: 'دعاء السفر',
      text: `اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا واطوِ عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل.

وإذا رجع قالهن وزاد فيهن: آيبون، تائبون، عابدون، لربنا حامدون.`,
      count: 1
    },
    {
      title: 'دعاء المسافر للمقيم',
      text: `استودعكم الله الذي لا تضيع ودائعه.`,
      count: 1
    },
    {
      title: 'دعاء المقيم للمسافر',
      text: `أستودع الله دينك وأمانتك، وخواتيم عملك، زودك الله التقوى، وغفر ذنبك، ويسر لك الخير حيث ما كنت.`,
      count: 1
    },
    {
      title: 'دعاء النزول في مكان',
      text: `أعوذ بكلمات الله التامات من شر ما خلق.`,
      count: 1
    },
    {
      title: 'الدعاء بين السجدتين',
      text: `رب اغفر لي، رب اغفر لي، اللهم اغفر لي، وارحمني واهدني واجبرني وعافني وارزقني وارفعني.`,
      count: 1
    },
    {
      title: 'دعاء من استصعب عليه أمر',
      text: `اللهم لا سهل إلا ما جعلته سهلًا، وأنت تجعل الحزن إذا شئت سهلًا.`,
      count: 1
    },
    {
      title: 'دعاء الخوف من الشرك',
      text: `اللهم إني أعوذ بك أن أشرك بك وأنا أعلم، وأستغفرك لما لا أعلم.`,
      count: 1
    },
    {
      title: 'ما يقال في المجلس',
      text: `رب اغفر لي وتب عليّ إنك أنت التواب الغفور.`,
      count: 100
    },
    {
      title: 'كفارة المجلس',
      text: `سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك.`,
      count: 1
    },
    {
      title: 'دعاء من رأى مبتلى',
      text: `الحمد لله الذي عافاني مما ابتلا به وفضلني على كثير ممن خلق تفضيلًا.`,
      count: 1
    },
    {
      title: 'دعاء الغضب',
      text: `أعوذ بالله من الشيطان الرجيم.`,
      count: 1
    },
    {
      title: 'الدعاء للمتزوج',
      text: `بارك الله لك، وبارك عليك، وجمع بينكما في خير.`,
      count: 1
    },
    {
      title: 'دعاء المتزوج لنفسه',
      text: `اللهم إني أسألك خيرها وخير ما جبلتها عليه، وأعوذ بك من شرها وشر ما جبلتها عليه، وإذا اشترى بعيرًا فليأخذ بذروة سنامه وليقل مثل ذلك.`,
      count: 1
    },
    {
      title: 'الدعاء قبل الجماع',
      text: `بسم الله، اللهم جنبنا الشيطان، وجنب الشيطان ما رزقتنا.`,
      count: 1
    },
    {
      title: 'دعاء العطاس',
      text: `إذا عطس أحدكم فليقل: الحمد لله، وليقل له أخوه أو صاحبه: يرحمك الله، فإذا قال له: يرحمك الله، فليقل: يهديكم الله ويصلح بالكم.`,
      count: 1
    },
    {
      title: 'الدعاء عند إفطار الصائم',
      text: `ذهب الظمأ، وابتلت العروق، وثبت الأجر إن شاء الله.`,
      count: 1
    },
    {
      title: 'الدعاء إذا أفطر عند أهل بيت',
      text: `أفطر عندكم الصائمون، وأكل طعامكم الأبرار، وصلت عليكم الملائكة.`,
      count: 1
    },
    {
      title: 'دعاء رؤية الهلال',
      text: `الله أكبر، اللهم أهله علينا بالأمن، والإيمان والسلامة، والإسلام، والتوفيق لما تحب وترضى، ربنا وربك الله.`,
      count: 1
    },
    {
      title: 'دعاء من أصيب بمصيبة',
      text: `إنا لله وإنا إليه راجعون، اللهم أجرني في مصيبتي واخلف لي خيرًا منها.`,
      count: 1
    },
    {
      title: 'الدعاء للمريض في عيادته',
      text: `لا بأس طهور إن شاء الله.

ما من عبد مسلم يعود مريضًا لم يحضر أجله فيقول سبع مرات: أسأل الله العظيم رب العرش العظيم أن يشفيك، إلا عوفي.`,
      count: 1
    },
    {
      title: 'دعاء المريض الذي يئس من حياته',
      text: `اللهم اغفر لي وارحمني والحقني بالرفيق الأعلى.`,
      count: 1
    },
    {
      title: 'ما يعوذ به الأولاد',
      text: `أعيذكما بكلمات الله التامة من كل شيطان وهامة، ومن كل عين لامة.`,
      count: 1
    },
    {
      title: 'دعاء لقاء العدو وذي السلطان',
      text: `حسبنا الله ونعم الوكيل.

اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم.

اللهم أنت عضدي، وأنت نصيري، بك أجول وبك أصول وبك أقاتل.`,
      count: 1
    },
    
   
    {
      title: 'دعاء دخول السوق',
      text: `لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير.

بسم الله، اللهم إني أسألك خير هذه السوق، وخير ما فيها، وأعوذ بك من شرها وشر ما فيها، اللهم إني أعوذ بك أن أصيب بها يمينًا فاجرةً، أو صفقة خاسرة.`,
      count: 1
    },
    {
      title: 'عند فعل الذنب أو ارتكاب المعصية',
      text: `كما أخبرنا رسول الله صلى الله عليه وسلم: ما من عبد يذنب ذنبًا فيتوضأ فيحسن الطهور، ثم يقوم فيصلي ركعتين، ثم يستغفر الله لذلك الذنب إلا غفر له.`,
      count: 1
    },
    {
      title: 'الدعاء عند سماع أصوات الحيوانات',
      text: `الدعاء عند صياح الديك: اللهم إني أسألك من فضلك.

إذا سمعتم صياح الديك من الليل فاسألوا الله من فضله فإنها رأت ملكًا، وإذا سمعتم نهيق الحمار فتعوذوا بالله من الشيطان فإنها رأت شيطانًا.

الدعاء عند صياح الديك ونهيق الحمار ونباح الكلاب: أعوذ بالله من الشيطان الرجيم.

إذا سمعتم نباح الكلاب ونهيق الحمير بالليل فتعوذوا بالله فإنهن يرين ما لا ترون.`,
      count: 1
    },
    {
      title: 'سيد الاستغفار',
      text: `اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك عليّ وأبوء بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت.

عن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال: سيد الاستغفار أن يقول العبد: اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك عليّ وأبوء بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت. من قالها في النهار موقنًا بها فمات من يومه قبل أن يمسي فهو من أهل الجنة، ومن قالها من الليل وهو موقن بها فمات قبل أن يصبح فهو من أهل الجنة.`,
      count: 1
    },
    {
      title: 'الدعاء إذا أحسست بوجع في جسدك',
      text: `ضع يدك على الذي تألم من جسدك وقل: بسم الله، ثلاثًا، وقل سبع مرات: أعوذ بالله وقدرته من شر ما أجد وأحاذر.`,
      count: 1
    },
    {
      title: 'ما يقول ويفعل من أذنب ذنبًا',
      text: `ما من عبد يذنب ذنبًا فيحسن الطهور ثم يقوم فيصلي ركعتين، ثم يستغفر الله إلا غفر له.`,
    }
    ],
  },
  {
  id: 'fadl-dua',
  name: 'فضل الدعاء',
  icon: 'Heart',
  azkar: [
    {
      title: 'معنى الدعاء',
      text: `الدعاء هو أن يطلبَ الداعي ما ينفعُه وما يكشف ضُرَّه؛ وحقيقته إظهار الافتقار إلى الله، والتبرؤ من الحول والقوة، وهو سمةُ العبوديةِ، واستشعارُ الذلةِ البشرية، وفيه معنى الثناءِ على الله عز وجل، وإضافةِ الجود والكرم إليه.`,
      count: 1
    },
    {
      title: 'الدعاء طاعة لله وامتثال لأمره',
      text: `قال تعالى: "وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ". [سورة غافر: الآية 60]`,
      count: 1
    },
    {
      title: 'الدعاء عبادة',
      text: `قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "الدُّعَاءُ هُوَ الْعِبَادَةُ". [رواه الترمذي وابن ماجه، وصححه الألباني]`,
      count: 1
    },
    {
      title: 'الدعاء أكرم شيء على الله تعالى',
      text: `قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللَّهِ تَعَالَى مِنْ الدُّعَاءِ". [رواه أحمد والبخاري، وابن ماجة، والترمذي والحاكم وصححه، ووافقه الذهبي]`,
      count: 1
    },
    {
      title: 'الدعاء سبب لدفع غضب الله',
      text: `قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "مَنْ لَمْ يَسْأَلْ اللَّهَ يَغْضَبْ عَلَيْهِ". [رواه الترمذي، وابن ماجة، وصححه الحاكم، ووافقه الذهبي، وحسنه الألباني]`,
      count: 1
    },
    {
      title: 'الدعاء سلامة من العجز ودليل على الكياسة',
      text: `قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "أَعْجَزُ النَّاسِ مَنْ عَجَزَ عَنْ الدُّعَاءِ وَأَبْخَلُ النَّاسِ مَنْ بَخِلَ بِالسَّلَامِ". [رواه ابن حبان وصححه الألباني]`,
      count: 1
    },
    {
      title: 'الدعاء سبب لرفع البلاء',
      text: `قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "مَنْ فُتِحَ لَهُ مِنْكُمْ بَابُ الدُّعَاءِ فُتِحَتْ لَهُ أَبْوَابُ الرَّحْمَةِ وَمَا سُئِلَ اللَّهُ شَيْئًا يَعْنِي أَحَبَّ إِلَيْهِ مِنْ أَنْ يُسْأَلَ الْعَافِيَةَ"، وقال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "إِنَّ الدُّعَاءَ يَنْفَعُ مِمَّا نَزَلَ وَمِمَّا لَمْ يَنْزِلْ فَعَلَيْكُمْ عِبَادَ اللَّهِ بِالدُّعَاءِ". [رواه الترمذي وحسنه الألباني]`,
      count: 1
    },
    {
      title: 'الداعي في معية الله',
      text: `قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "يقول الله عز وجل: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا دَعَانِي". [رواه مسلم]`,
      count: 1
    },
    {
      title: 'فضل الدعاء في السجود',
      text: `قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ عَزَّ وَجَلَّ وَهُوَ سَاجِدٌ، فَأَكْثِرُوا الدُّعَاءَ". [رواه مسلم]`,
      count: 1
    },
    {
      title: 'فضل الدعاء بالليل',
      text: `قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "إِنَّ فِي اللَّيْلِ لَسَاعَةً لَا يُوَافِقُهَا رَجُلٌ مُسْلِمٌ يَسْأَلُ اللَّهَ تَعَالَى مِنْ أَمْرِ الدُّنْيَا وَالْآخِرَةِ إِلَّا أَعْطَاهُ إِيَّاهُ، وَذَلِكَ كُلَّ لَيْلَةٍ". [رواه مسلم]`,
      count: 1
    },
    {
      title: 'فضل الدعاء للمسلمين بظهر الغيب',
      text: `قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "مَا مِنْ عَبْدٍ مُسْلِمٍ يَدْعُو لِأَخِيهِ بِظَهْرِ الْغَيْبِ إِلَّا قَالَ الْمَلَكُ: وَلَكَ بِمِثْلٍ". [رواه مسلم]`,
      count: 1
    }
    ],
  },
  {
  id: 'fadl-dhikr',
  name: 'فضل الذكر',
  icon: 'Heart',
  azkar: [
    {
      title: 'فضل الذكر',
      text: `إنَّ من أفضل الأعمال الصالحة اليسيرة التي تقرب المسلم إلى ربه جل وعلا الذكرُ.`,
      count: 1
    },
    {
      title: 'آيات وأحاديث في فضل الذكر والدعاء والحث عليهما',
      text: `ورد في فضل الذكر والدعاء والحث عليهما آيات كثيرة، وأحاديث صحيحة عن رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نذكر ما تيسر منها.`,
      count: 1
    },
    {
      title: 'آيات في فضل الذكر',
      text: `قال تعالى: "وَلَذِكْرُ اللَّهِ أَكْبَرُ".

وقال تعالى: "وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا".

وقال تعالى: "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ".

وقال تعالى: "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا".

وقال تعالى: "وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا".

وقال تعالى: "وَاذْكُرْ رَبَّكَ كَثِيرًا وَسَبِّحْ بِالْعَشِيِّ وَالْإِبْكَارِ".

وقال تعالى: "الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ".

وقال تعالى: "فَإِذَا قَضَيْتُم مَّنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا".

وقال تعالى: "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَن ذِكْرِ اللَّهِ".

وقال تعالى: "وَاذْكُرْ رَبَّكَ فِي نَفْسِكَ تَضَرُّعًا وَخِيفَةً وَدُونَ الْجَهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالْآصَالِ وَلَا تَكُنْ مِنَ الْغَافِلِينَ".`,
      count: 1
    },
    {
      title: 'أحاديث في فضل الذكر',
      text: `وقال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "مثل الذي يذكر ربه والذي لا يذكر ربه مثل الحي والميت".

وقال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "ألا أنبئكم بخير أعمالكم وأزكاها عند مليككم وأرفعها في درجاتكم وخير لكم من إنفاق الذهب والورق وخير لكم من أن تلقوا عدوكم فتضربوا أعناقهم ويضربوا أعناقكم؟" قالوا: بلى. قال: "ذكر الله تعالى".

وقال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "يقول الله تعالى: أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأ خير منهم، وإن تقرب إلي شبرًا تقربت إليه ذراعًا، وإن تقرب إلي ذراعًا تقربت إليه باعًا، وإن أتاني يمشي أتيته هرولة".

وقال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "من قعد مقعدًا لم يذكر الله فيه كانت عليه من الله تِرَة، ومن اضطجع مضجعًا لم يذكر الله فيه كانت عليه تِرَة".

وقال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "ما جلس قوم مجلسًا لم يذكروا الله فيه، ولم يصلوا على نبيهم إلا كان عليهم تِرَة، فإن شاء عذبهم وإن شاء غفر لهم".

وقال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "ما من قوم يقومون من مجلس لا يذكرون الله فيه إلا قاموا عن مثل جيفة حمار وكان لهم حسرة".`,
      count: 1
    },
    {
      title: 'من فضائل الذكر - 1',
      text: `ذكر الإمام ابن القيم رحمه الله من فضائل الذكر:

أنه يطرد الشيطان ويقمعه ويكسره.

أنه يرضي الرحمن عز وجل.

أنه يزيل الهم والغم عن القلب.

أنه يجلب للقلب الفرح والسرور والبسط.

أنه يجلب الرزق.

أنه يكسو الذاكر المهابة والحلاوة والنضرة.`,
      count: 1
    },
    {
      title: 'من فضائل الذكر - 2',
      text: `أنه يورثه المحبة التي هي روح الإسلام وقطب رحى الدين ومدار السعادة والنجاة، وقد جعل الله لكل شيء سببًا، وجعل سبب المحبة دوام الذكر، فمن أراد أن ينال محبة الله عز وجل فليلهج بذكره، فإنه باب المحبة وشارعها الأعظم وصراطها الأقوام.

أنه يورثه المراقبة حتى يدخله في باب الإحسان، فيعبد الله كأنه يراه، ولا سبيل للغافل عن الذكر إلى مقام الإحسان.

أنه يورثه الإنابة وهي الرجوع إلى الله عز وجل، فمتى أكثر الرجوع إليه بذكره أورثه ذلك رجوعه بقلبه إليه في كل أحواله.

أنه يورث الهيبة لربه عز وجل وإجلاله لشدة استيلائه على قلبه وحضوره مع الله تعالى.`,
      count: 1
    },
    {
      title: 'من فضائل الذكر - 3',
      text: `أنه يورثه ذكر الله تعالى له كما قال تعالى: "فَاذْكُرُونِي أَذْكُرْكُمْ"، ولو لم يكن في الذكر إلا هذه وحدها لكفى بها فضلًا وشرفًا.

أنه يحط الخطايا ويذهبها، فإنه من أعظم الحسنات، والحسنات يذهبن السيئات.

أنه يزيل الوحشة بين العبد وبين ربه تبارك وتعالى، فإن الغافل بينه وبين الله وحشة لا تزول إلا بالذكر.

أن العبد إذا تعرف إلى الله تعالى بذكره في الرخاء عرفه في الشدة.

أنه ينجي من عذاب الله تعالى.`,
      count: 1
    },
    {
      title: 'من فضائل الذكر - 4',
      text: `أنه سبب تنزيل السكينة، وغشيان الرحمة، وحفوف الملائكة بالذاكر.

أنه سبب اشتغال اللسان عن الغيبة والنميمة والكذب والفحش والباطل، فإن العبد لا بد له من أن يتكلم، فإن لم يتكلم بذكر الله تكلم بهذه المحرمات أو بعضها.

أنه يؤمن العبد من الحسرة يوم القيامة، فإن كل مجلس لا يذكر العبد فيه ربه تعالى كان عليه حسرة وتِرَة يوم القيامة.

أنه أيسر العبادات، وهو من أجلها وأفضلها، فإن حركة اللسان أخف حركات الجوارح وأيسرها.

أنه غراس الجنة.`,
      count: 1
    },
    {
      title: 'من فضائل الذكر - 5',
      text: `أن العطاء والفضل الذي رتب عليه لم يرتب على غيره من الأعمال.

أن دوام ذكر الرب تبارك وتعالى يوجب الأمان من نسيانه، الذي هو سبب شقاء العبد في معاشه ومعاده.

أن الذكر نور للذاكر في الدنيا، ونور له في قبره، ونور له في معاده، يسعى بين يديه على الصراط.

أن الذكر يجمع المتفرق، ويفرق المجتمع، ويقرب البعيد، ويبعد القريب.

أن في القلب قسوة لا يذيبها إلا ذكر الله تعالى، فينبغي للعبد أن يداوي قسوة قلبه بذكر الله تعالى.`,
      count: 1
    },
    {
      title: 'من فضائل الذكر - 6',
      text: `أن الذكر يوجب صلاة الله عز وجل وملائكته على الذاكر.

أن مجالس الذكر مجالس الملائكة، وليس من مجالس الدنيا لهم مجلس إلا مجلس يذكر الله تعالى فيه.

أن الله عز وجل يباهي بالذاكرين ملائكته.

أن جميع الأعمال إنما شرعت لإقامة ذكر الله تعالى، والمقصود بها تحصيل ذكر الله تعالى.

أن ذكر الله عز وجل يسهل الصعب، وييسر العسير، ويخفف المشاق، ويذهب الشدة والكربة.`,
      count: 1
    },
    {
      title: 'من فضائل الذكر - 7',
      text: `أن كثرة ذكر الله عز وجل أمان من النفاق، فإن المنافقين قليلو الذكر لله عز وجل.

أن الذكر سبب للبركة في المجالس، وبركته تعود على الذاكر وعلى جليسه.

أن الذاكر قريب من معاني الإيمان والإحسان والمراقبة والإنابة.

أن الذكر حياة للقلوب، كما أن الغفلة موت لها.

أن الذكر من أعظم أبواب صلاح العبد في دنياه وآخرته.`,
      count: 1
    }
    ],
  },



];

// ============================================================
// Duaa al-Anbiya
// ============================================================

export const duaaAnbiya: { prophet: string; duaa: string }[] = [
  { prophet: 'آدم عليه السلام', duaa: 'رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ' },
  { prophet: 'نوح عليه السلام', duaa: 'إِنَّكَ أَنتَ الغَفُورُ الرَّحِيمُ' },
  { prophet: 'إبراهيم عليه السلام', duaa: 'رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ' },
  { prophet: 'موسى عليه السلام', duaa: 'رَبِّ اشْرَحْ لِي صَدْرِي ۝ وَيَسِّرْ لِي أَمْرِي' },
  { prophet: 'عيسى عليه السلام', duaa: 'إِن تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ ۖ وَإِن تَغْفِرْ لَهُمْ فَإِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ' },
  { prophet: 'محمد ﷺ', duaa: 'اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي' },
];